[{"content": ["The ", " is the championship series of the ", ". The series was named the ", " until 1986.", "The series is played between the winners of the ", " and ", " ", ". At the conclusion of the championship round, the winners of four (4) games of the NBA Finals are awarded the ", ". (Winners from 1946 to 1983 received the ", " redesigned in 1977 to the current form.) The NBA Finals has been played at the end of every NBA and ", " season in history, the first being held in ", ".", "Between 1985 and 2013, the winner of the NBA Finals was determined through a 2–3–2 format: the first and last two games of the series being played at the arena of the team who earned home court advantage by having the better record during the regular season. Most NBA Finals series were played under the 2–2–1–1–1 format prior to 1985, the format will be used in 2014.", "During the first decade the ", " had the first NBA dynasty, winning five championships in six years under ", " head coach ", ". The team also featured ", ", one of the greatest players in NBA history.", "The ", " went 11–1 in the NBA Finals during 13 seasons (1956–67 to 1968–69). They won eight straight NBA championships from 1959 through 1966.", "The Celtics and Lakers made up 19 of 26 possible NBA appearances during thirteen seasons (1956–67–1968–69). The two teams met six times during the eight years Boston won the NBA in a row.", " This period includes one season (1958–59) when the Lakers were still in Minneapolis, and it marks the largest stretch of seasons (14) that two teams made up over 65% of NBA appearances, second being the 10 seasons (1979–80 to 1988–89) the Celtics and Lakers appeared 13 times.", "With the establishment of the Celtics dynasty in 1957, ", " became the star of the league. Game 7 of the NBA Finals was decided on a Celtics basket in the final seconds of the second overtime. For most of the late 1950s and 1960s, the Celtics always seemed to have the upper hand on ", "'s teams.", "In 1964, ", ", who had moved to the state of California with his team, the former Philadelphia Warriors, led the ", " to a Western Conference championship, but again failed to conquer the Celtics. The following season, he joined the ", ", the former Syracuse Nationals team that had moved to cover the vacancy created with the departure of the Warriors.", "A clash between the two stars in the playoffs was in 1966 and Boston won it 4–1. Chamberlain's coach told him to play a team game, not an individual game, and thus avoid drawing double-teams. His new-found team spirit brought them to a new record of 68 wins the following season, and they defeated the Celtics and then advanced to, and won, the Finals.", "In 1968, Boston overcame a 3–1 deficit against Philadelphia to once again arrive in the Finals. They went on to defeat the ", " for the sixth straight time, 4 games to 2.", "In 1969, the Celtics overcame even longer odds. Boston was an aging team and had injuries to a number of players. They barely qualified for the playoffs, finishing fourth in the East. The Lakers, who in the offseason added Chamberlain to join West and Elgin Baylor, won the West and were prohibitive favorites to finally win it all for the first time since relocating to L.A. They won the first two games at the ", ". However, when the series shifted to ", ", the Celtics won Games 3 110–105. Game 4 was the turning point, as the Lakers led 87-86 and had the ball with 10 seonds to play. But after a turnover, Sam Jones put up a shot that hit the front of the rim, the back heel, rolled around, and went in, giving the Celtics an 88-87 win and tying the series. Game 5, played at the Forum, returned the advantage to the Lakers, but Game 6 was a 99–90 Celtics win, with Chamberlain scoring just two points. Game 7 was held on May 5; Lakers owner ", " had balloons hung up in the arena in anticipation of a Lakers victory. When ", " saw the balloons he was furious, while Russell immediately used the balloons as an inspiration for his team. With West nursing a sore thigh and hamstring, Russell ordered his team to fast break at every chance and they raced off to an early lead. They held off a furious Lakers comeback to win 108–106 and win the series, their eleventh championship in 13 years. This game represented the final one of the Celtics' dynasty.", "The 1970s saw eight different teams win the title, with the Celtics and Knicks winning twice.", "In ", ", a classic final featured the ", " against the Lakers. In the waning moments of Game 3, with the series tied, Jerry West hit a basket from 60 feet to tie the game, a shot which became one of the most famous ever. Although the Knicks won in ", " and continued their momentum for a 4–3 win, the Lakers were not defeated. Just two seasons later, the team won 33 straight games, the longest such streak in NBA history. By season's end, they broke the record for most wins in a season with 69, one more than the 1966–67 76ers. The Lakers finally, after a tough postseason, took home the ", " for the first time since the Minneapolis days. The Knicks won the championship again in ", ", using much the same formula, for their second franchise victorious season.", "The ", " went back to the Celtics as the remaining players demonstrated excellent teamwork and resilience in the Finals.", "The late 1970s were characterized by a major breakthrough of the league's western franchises. In 1975, after compiling a 48–34 regular-season record, the ", " swept the heavily favored Washington Bullets 4–0 in the ", ".", "1976 saw the rise of the ", ". Only eight years in existence, they overcame a losing record early in the season to build remarkable win streaks to finish 42–40. The events culminated in upset victories over Seattle and Golden State. In the final against Boston, the teams split the first four games. Game 5 went into three overtimes but eventually went to Boston 128–126. Two days later, the Celtics finished Phoenix off 87-80 in Game 6 for their 13th championship.", "Other western franchises that won their first titles in the late 1970s included the Portland Trail Blazers in 1977 and the Seattle SuperSonics in 1979. Portland's victory was against the heavily favored Philadelphia 76ers led by Julius Erving. Although the Washington Bullets were able to defeat Seattle in the 1978 NBA Finals, Seattle was able to prevail the following year against the Bullets to win its first NBA title.", "Between 1980 and 1989, the Celtics and/or the Lakers played in every NBA Finals.", " The Lakers won five titles from 1980-1990 (1980, 1982, 1985, 1987, and 1988); the Celtics won three (1981, 1984, and 1986); the Pistons won twice (1989 and 1990); and the Sixers won once (1983).", "The 1979 ", " featured ", "'s ", " team facing off against ", "'s ", " team. Michigan State won. This meeting has been immortalized; in fact, it attracted the largest ever TV rating for an NCAA Championship game, with 38 percent of all television viewers that night tuned to the game.", "Bird had actually been drafted the year before, but later decided to stay one more year, and the two superstars entered the league in 1979, leading their respective teams to dazzling heights. Johnson's Lakers reached the ", " against Julius Erving's 76ers, and took a 3–2 lead, but ", " could not play in Game 6 due to injury. Johnson shifted to center, ended up playing every position on the court and scored 42 points to win his first championship, a remarkable performance in the annals of the sport.", "Boston reached the ", " led by the \"Big Three\" of Larry Bird, ", ", and ", ". During the ", ", the Celtics traded two first round picks to the Warriors for Parish and a first round pick later spent on McHale. Considered to be one of the best Front Courts of all time, all three players would later make the NBA Hall of Fame. They met the Rockets in the 1981 Finals, practically single handily carried by Moses Malone who upset Magic's Lakers in the first round. The Rockets were only the second team in NBA history to make the Finals after posting a losing record in the regular season, and the Celtics had an NBA best record of 62-20. After reasserting themselves as a Powerhouse in the NBA, the Celtics won the Finals in 6 games.", "Led by new coach ", ", the Lakers returned to the ", " in a rematch against the 76ers. The 76ers had barely managed to defeat the Celtics in the Eastern Conference finals, as the series went to 7 games. However, the Lakers were able to dispatch of the 76ers in 6 games, with Magic Johnson being named Finals MVP. Philadelphia, losing their past three NBA Finals appearances, decided that they needed one more piece to become a champion. On September 15, 1982 they traded for NBA-MVP Moses Malone.", "Philadelphia, led by ", " and ", ", won the ", ", losing only once in the entire playoffs, and sweeping the Lakers. (Malone had predicted earlier that they would sweep every series in \"Fo-Fo-Fo\".) However, in the ", ", the Celtics and Lakers met for the first time since 1969, and again, from Bird's performance, the Celtics toppled the Lakers 4–3. Game 7 attracted the largest TV audience ever for an NBA game, and the second-largest ever for a basketball game, with only the game between the two stars played five years earlier having a larger audience. It was the last NBA Finals played in the 2–2–1–1–1 format until 2014.", "In the ", ", the Lakers made amends for their previous eight losses to the Celtics by defeating them in six games. After losing the first game in a rout, 148–114, dubbed the \"", "\", they won 4 out of 5, including Game 6 in Boston Garden, to finally end the long years of frustration of failing to defeat the Celtics. These finals were the first to be played in the 2–3–2 format, which Red Auerbach suggested to David Stern in order to cut back on the frequent traveling between Boston and Los Angeles.", "The ", " brought the Celtics back against the Rockets. Boston won in six games, taking their 16th title, with the MVP award going to Larry Bird, his second Finals MVP trophy.", "In ", ", the Lakers and Celtics met again for a rubber match. Both sides had won one series, and now a third was being played. The Lakers won the first two games, but Boston won Game 3. In Game 4, Magic Johnson hit a sky-hook with two seconds left to give the Lakers a 107–106 win and a 3–1 series lead. They lost Game 5, but won Game 6 to take the series.", "In 1988 and 1989, the aging Celtics failed to reach the Finals, with the Lakers and Pistons becoming the best of their conferences. The ", " went to L.A. 4–3, but the Pistons swept the Lakers in ", ". In ", ", Detroit beat the Blazers in five games, and the name \"Bad Boys\" became attached to the team for its rough, physical play. Led by a Hall of Fame back court in ", " and ", " and a rough, physical front court with Dennis Rodman and ", ", the Pistons were able to fight past the up-and-coming superstar of Michael Jordan and the Chicago Bulls.", "The majority of the 1990s was marked by the ", "' dynasty, which ended in 1998. Coached by ", " and led by superstar ", ", the Bulls won 6 titles from 1991 to 1998. Supported by ", " and ", ", Jordan won the Finals MVP award every time.", "The first championship came at the expense of the Los Angeles Lakers, the last appearance in the Finals for ", ". Billed as a showdown between the aging Magic and the upstart Jordan, the Lakers won the first game 93-91. For the rest of the series, Pippen would guard Magic, with Chicago ultimately taking the next four games. The Bulls returned to the Finals in the next year, pit against ", " and the ", ". Throughout the 1991-1992 season, Jordan and Drexler led their teams to the best record in their respective conference, leading to several comparisons between the two players in anticipation of a postseason match-up. Chicago blew out the Trail Blazers in Game 1, a game most famous for Jordan shrugging after his record breaking sixth three-pointer in the first half. Game 2 went into overtime, with the Trail Blazers outscoring the Bulls 18-7 in the final period to run away with the win. Game 3 and 4 were split between Chicago and Portland, respectively, but the Bulls took the final two games, clinching their second championship.", "In 1993, Jordan was matched against his close friend, MVP ", " of the ", ". The Bulls won the first two games in Phoenix convincingly, with 100–92 and 111–108 as the final scores respectively. The Suns, rallying behind Barkley, won Game 3 129–121 at Chicago in triple overtime. The Bulls took Game 4 111–105, with Jordan scoring 55 points and tying Rick Barry for the second-most amount of points in an NBA Finals game. Before the Bulls could celebrate, however, the Suns won Game 5 108–98, sending the series back to Phoenix. Chicago won the series clincher in Game 6 99–98 on ", "'s clutch 3, leading the Bulls to become only the third team in history to ", ".", "Known as Clutch City, the ", ", led by ", ", won the 1994 and 1995 NBA title. Olajuwon dominated during those two seasons, becoming the only player in history to win the ", ", ", " and NBA Finals Most Valuable Player Award in the same season (1993–94). It was the only year that the NBA and NHL finals went 7 games, but also involve teams from one city. The Rockets' win in Game 7 denied New York from having NBA and NHL titles in the same year, as the ", " won the ", " during the series. The Rockets swept the ", " in the 1995 Finals; Olajuwon was named again Finals MVP. The Rockets became only the fifth franchise to win back-to-back titles. Notably, Portland's Drexler was on the 1995 Rockets team.", "After a short stint as a baseball player, Jordan returned to basketball late in the 1994–95 season (March 17). Although he did not lead the Bulls to the Finals, he returned to pre-retirement form the next year while the team acquired Dennis Rodman, leading the Bulls to one of the most memorable seasons ever. The ", " finished the regular season 72–10, the best regular season record in NBA history. They dominated in the playoffs, with series records of 3–0, 4–1 and 4–0, before facing off against the ", " in the NBA Finals. Although the Bulls took a 3-0 series lead, Seattle won the next two games after coach ", " switched point guard ", " onto Jordan, leading to a sixth game before the Bulls could close it out.", "In 1997 and 1998, the Bulls met the ", ". Led by ", " ", " and ", ", the Jazz were defeated in both Finals by the Bulls in six games. In both series, Chicago won by hitting winning shots in the sixth and deciding game-the first by ", " in 1997 in Chicago and the second by Jordan in Utah in 1998. Although Jordan, Pippen and Jackson were the only three involved in all 6 titles, the Bulls dynasty had a cast of characters that were decisive in obtaining them. ", ", ", ", John Paxson, ", " and other supporting cast members were pieces added to the puzzle to create the first three-peat. Of the second, little-known players such as ", ", ", ", ", ", ", " and ", " were key factors who rarely produced an astounding amount of points, but proved crucial via setting picks, rebounding, creating turnovers, etc. Before the beginning of the 1999 season, Jackson decided to retire, which set off a chain reaction that resulted in most of the team, including Jordan and Pippen, to leave the Bulls. With no foundation of youth to build upon, the Bulls would be ", " for the next 6 years.", "The ", " and ", " combined to win 11 of the 12 Western Conference titles and nine NBA Championships during this period.", "The Spurs won four championships during this period, in 1999, 2003, 2005, and 2007. In the 1999 NBA Playoffs, the Spurs finished with a 15–2 mark, including sweeps of the Blazers and Lakers. With a defensive squad led by ", " and ", ", San Antonio's 84.7 points allowed per game was the fewest average points allowed in the post-season in the last 30 years. In the ", " that year, the Spurs held the ", ", the first #8 seed team to reach the finals in NBA history, to an average of 79.8 points per game. From 2003 to 2007, San Antonio would win three more championships in five years, but never repeated as champions. During the ", ", the Spurs defeated the Nets in 6 games. Said Finals also marked the first championship contested between two former ABA teams. In Game 6, Duncan was two blocks short of recording the first ", " in NBA Finals history, finishing with 21 points, 20 rebounds, 10 assists, and 8 blocks. The Spurs went on to defeat the defending champion Detroit Pistons 4-3 in the ", ", as well as sweeping the ", " in the ", ". Duncan won the Finals MVP in 1999, 2003 and 2005. In 2007, ", " was named MVP, becoming the first European-born player to win the award.", "From 2000–2002, the Lakers, led by ", " and ", ", won three straight NBA Championships. O'Neal won the finals MVP all three times. Their ", " came at the expense of the ", ", whom the Lakers defeated in 6 games. During their ", " postseason run, the Lakers swept their first 3 series and won the Finals in 5 games, finishing with an unprecedented 15–1 record. Their opponent in the Finals was the ", ", led by ", ". Entering the ", ", In the ", ", the Lakers swept the ", ", leading almost the entire time in each game; only for a short while after the beginning of Game 4 did the ", " gain any significant lead in a game.", "In the 2004 offseason, veteran stars ", " and ", " signed with the Lakers. Along with Bryant and O'Neal, they formed what many expected to be one of the best teams in NBA history, and were the favorites to win the championship. However, the ", ", under coach ", ", upset the Lakers in 5 games. ", " was named the Finals MVP. The Pistons were also the first team to win games 3, 4, and 5 at home in the Finals since the series switched to a 2-3-2 rotation in 1985, a feat that has since been repeated by the 2006 and 2012 Miami Heat. Now established as one of the premier powerhouses of the East, Detroit would return to the NBA Finals in the following year, bowing out to the Spurs in seven games.", "The ", " were the only Finals between 1999 and 2010 not to feature the Spurs or Lakers. Instead, it featured the ", " and ", ". It was the first NBA Finals since 1971 that had both Western and Eastern Conference champions making their first Finals appearance in franchise history. The Mavericks won the first two games at home, but the turning point of the series was in Game 3, when the Heat overcame a 13-point deficit with less than 6 minutes left in the fourth quarter to win 98–96. The comeback was led by Wade's 12 points in the final six minutes and a clutch outside jumpshot by ", ", who was appearing in his third NBA finals. Miami swept all three of their home games, two of which were sparked by fourth quarter comebacks led by Wade; the Heat would win their first championship in game six.", "The Lakers returned to the finals in 2008, against the ", ". Renewing the teams' fierce rivalry of the 1980s, this marked the 11th time that these two teams met in the Finals, the last such meeting happening in 1987. The Celtics, who defeated the Lakers 4-2, were led by their \"Big Three\" superstars: Long-time Celtic and Finals MVP ", ", and first year Celtics ", " and ", ".", "The Lakers bounced back from their 2008 loss and returned to the Finals in 2009, where they faced the ", ", led by ", " ", " in ", ". Los Angeles would defeat Orlando in five games, with Bryant earning the Finals MVP award. The Lakers met the Celtics once again in ", ". The Lakers trailed 3-2 before winning the last two at home, marking the first time in the history of the Celtics franchise that Boston lost a Game 7 in the NBA Finals. ", " was named Finals MVP once again. The 2009 and 2010 titles were Lakers' coach ", "'s 10th and 11th NBA titles, passing ", " for the most NBA titles all time. Jackson would also pass Auerbach and ", " coach ", " for the most titles for a head coach in any major American sport.", "During the 2010 offseason, the ", " added free agents ", " and ", ", who along with team captain ", ", formed what many dubbed the \"Big 3.\" The Heat were considered by many to win the title, not just the following season, but for years to come. The Heat would represent the Eastern Conference in the next four finals, winning two of them.", "The ", " put the Heat against the ", " in a rematch of the finals from ", ". The Mavericks, who were led by ", " and ", ", ", ", and ", ", won the series 4-2, with Nowitzki being named the ", ". The Heat returned to the finals in ", " against the ", ", in a series that had 3-time ", " James and 3-time ", " ", ", neither of whom had won a championship at the time. After the Thunder took Game 1 at home, the Heat won four straight games to win the series 4-1. The Heat became the first team ever to win a championship after trailing in three different series. James was unanimously named NBA Finals MVP. The Heat won a second title in 2013, this time over the ", ". The 2013 Finals was the first Finals since 1987 to feature four former Finals MVPs: ", " (1999, 2003, 2005) and ", " (2007) for the Spurs and ", " (2006) and ", " (2012) for the Heat. The Spurs were up 3-2 in the series going into Game 6 at the American Airlines Arena in Miami. With seconds remaining in regulation, Miami's ", " scored a game-tying three-pointer to send the game into overtime,and the Heat would prevail 103-100. The game is considered by some to have been one of the greatest playoff games in NBA history.", " The Heat would win Game 7, 95-88, to clinch the title. James was named the Finals MVP for the second straight year.", "Looking for a ", ", the Heat dominated in the ", ". They have made the ", " and will face off against the San Antonio Spurs, once again in a rematch of the ", ". The Spurs will have home-court advantage since they ended the regular season with a better record.", "The statistics below refer to series wins and losses, not individual games won and lost.", "The statistics below refer to series wins and losses, not individual games won and lost."], "title": ["NBA Finals - Wikipedia, the free encyclopedia"]},
{"content": ["The ", " (formerly ", " from 1946–49) ", " is the championship series for the NBA and the conclusion of the sport's ", ". All Finals have been played in a ", ", and contested between the winners of the ", " and the ", " (formerly Divisions before 1970), except in ", " in which the Eastern Division champion faced the winner between the Western and ", " champions. Prior to ", ", the playoffs were instituted a three-stage tournament where the two semifinal winners played each other in the finals.", " The winning team of the series receives the ", ".", "The home-and-away format in the NBA Finals is in a 2–2–1–1–1 format (the team with the better regular season record plays on their home court in Games 1, 2, 5 and 7). It was previously in a 2–3–2 format (the team with the better regular season record plays on their home court in Games 1, 2, 6 and 7) during ", " and ", "–", ", ", "–", ";", " in a 1–1–1–1–1–1–1 format during ", " and ", ";", " in a 1–2–2–1–1 format during ", " and ", ".", "The Eastern Conference/Division leads the Western Conference/Division in series won (37–29). The defunct Central Division won one championship. The ", " alone own almost half of the titles, having won a combined 33 of 67 championships. The current NBA champions are the ", ".", "The trophy was originally referred to as the NBA Finals trophy,", " but was renamed in ", " after ", ", the original owner of the ", " who was instrumental in merging the BAA and the ", " into the NBA in 1949.", "The originally designed trophy was awarded to the BAA/NBA champions from 1949 to ", ". The trophy was kept by the winning team for one year and given to the winning team of the following year's finals, unless the previous team won again, much like the ", " ", ", which continues that tradition to this day.", "A new trophy design was created for the ", ", although it retained the Walter A. Brown title. Unlike the original championship trophy, the new trophy was given permanently to the winning team and a new one was made every year. It was renamed the ", " in ", " to honor former NBA ", " ", ".", "The inaugural winner of the trophy were the ", ", who defeated the ", ".", " The Boston Celtics won the trophy 14 times, the most in league history. From 1957 to 1969, they won the NBA Finals 11 out of 13 times, including eight consecutive wins. The final recipient of the trophy was the ", ", who defeated the ", " in the ", ".", "As mentioned above, the trophy was renamed to the Larry O'Brien Championship Trophy in 1984 in honor of Larry O'Brien, who served as the NBA commissioner from 1975 to 1983.", " The trophy is made out of 14.5 pounds of sterling silver and ", " with a 24 karat gold overlay, and stands 2 feet (0.61 m) tall. It is designed to look like a basketball about to enter a net. The year and team names are engraved on the trophies, and are often prominently displayed in the team's arena.", "The ", " were the inaugural winner of the renamed trophy in 1984 defeating the ", " in seven games (4–3) in the ", ".", " The Los Angeles Lakers have won the trophy eight times, and the ", " have won it six times.", " The ", " are the current holders after winning the title for the second time in a row, in 2013.", " "], "title": ["List of NBA champions - Wikipedia, the free encyclopedia"]},
{"content": [" ", " > ", " > ", " ", "Click on the ", " or ", " for playoff results and stats.", "\nClick on the ", " or ", " for team roster, stats, and\nleaders.", "\nClick on the ", " or ", " for career stats and\naccomplishments."], "title": ["NBA & ABA Playoff Index | Basketball-Reference.com"]},
{"content": [], "title": ["NBA Championships: Year by Year Champions"]}]