[{"content": ["Python is a general-purpose interpreted, interactive, object-oriented and high-level programming language. Python was created by Guido van Rossum in the late eighties and early nineties. Like Perl, Python source code is also now available under the GNU General Public License (GPL).", "This tutorial has been designed for software programmers with a need to understand the Python programming language starting from scratch. This tutorial will give you enough understanding on Python programming language from where you can take yourself to a higher level of expertise.", "Before proceeding with this tutorial you should have a basic understanding of Computer Programming terminologies. A basic understanding of any of the programming languages will help you in understanding the Python programming concepts and move fast on the learning track.", "For most of the examples given in this tutorial you will find ", " option, so just make use of it and enjoy your learning.", "Try following example using ", " option available at the top right corner of the below sample code box:", "A quick Python reference guide for Python Programmers.", "A collection of ", " Sites, Books and Articles is given at this page.", "Here you will find a useful Python's tools and utilities which you will require very frequently while doing Python programming.", "Download a quick Python tutorial in PDF format.", "Copyright © 2014 by tutorialspoint. All Rights Reserved."], "title": ["Python tutorial"]},
{"content": ["Python is an easy to learn, powerful programming language. It has efficient\nhigh-level data structures and a simple but effective approach to\nobject-oriented programming. Python’s elegant syntax and dynamic typing,\ntogether with its interpreted nature, make it an ideal language for scripting\nand rapid application development in many areas on most platforms.", "The Python interpreter and the extensive standard library are freely available\nin source or binary form for all major platforms from the Python Web site,\n", ", and may be freely distributed. The same site also\ncontains distributions of and pointers to many free third party Python modules,\nprograms and tools, and additional documentation.", "The Python interpreter is easily extended with new functions and data types\nimplemented in C or C++ (or other languages callable from C). Python is also\nsuitable as an extension language for customizable applications.", "This tutorial introduces the reader informally to the basic concepts and\nfeatures of the Python language and system. It helps to have a Python\ninterpreter handy for hands-on experience, but all examples are self-contained,\nso the tutorial can be read off-line as well.", "For a description of standard objects and modules, see ", ".\n", " gives a more formal definition of the language.  To write\nextensions in C or C++, read ", " and\n", ". There are also several books covering Python in depth.", "This tutorial does not attempt to be comprehensive and cover every single\nfeature, or even every commonly used feature. Instead, it introduces many of\nPython’s most noteworthy features, and will give you a good idea of the\nlanguage’s flavor and style. After reading it, you will be able to read and\nwrite Python modules and programs, and you will be ready to learn more about the\nvarious Python library modules described in ", ".", "The ", " is also worth going through.", "\n    Enter search terms or a module, class or function name.\n    "], "title": ["The Python Tutorial — Python v2.7.7 documentation"]},
{"content": ["When CivilizationTM IV (Firaxis Games, published by Take2) was announced, one of the most exciting features was that much of the scripting code will be in python, and the game data in XML. This tutorial attempts to teach you the basics of python programming that you could use with civIV.", "Of course, this tutorial is not limited to those who want to play a slow-paced turn-based strategy game. That is what it was written for, but is perfectly useful to any person with ", ", who wants to learn python. But what makes this tutorial unique, is that it is written for beginners, by a beginner.", "Then we also have the (to be written) Civilization IV python introduction. It will begin its release in early November."], "title": ["Sthurlow.com - Home"]},
{"content": ["Welcome to the LearnPython.org interactive Python tutorial.", "Whether you are an experienced programmer or not, this website is intended for everyone who wishes to learn the Python programming language.", "You are welcome to join our group on ", " for questions, discussions and updates.", "Just click on the chapter you wish to begin from, and follow the instructions. Good luck!", "Read more here: "], "title": ["Welcome - Learn Python - Free Interactive Python Tutorial"]}]