[{"content": ["The ", " were an ", " (1944–47) team, and later, a ", " (1947–49), and (beginning in 1949, following the BAA's absorption of the ", ") a ", " team based in ", ". The team folded November 27, 1954 with a 3–11 record, making the Bullets the last NBA franchise to do so, as of 2012.", " Out of all defunct NBA teams, the Bullets were members of the association for the longest time and the only defunct team to win a championship.", " The team took their name from the ", " Bullets athletic shoes, which were made in nearby ", ".", "Stats updated October 2, 2006"], "title": ["Baltimore Bullets (1944–54) - Wikipedia, the free encyclopedia"]},
{"content": [" ", " > ", " > ", " ", "Click on the ", " or ", " for playoff results and stats.", "\nClick on the ", " or ", " for team roster, stats, and\nleaders.", "\nClick on the ", " or ", " for career stats and\naccomplishments."], "title": ["NBA & ABA Playoff Index | Basketball-Reference.com"]},
{"content": [], "title": ["NBA Championships: Year by Year Champions"]},
{"content": ["Away: ", "The ", " is the 64th season of the franchise, 62nd in the ", " (NBA) and 50th in Los Angeles. Coming off a championship in 2009, the Lakers successfully defended their title. They spent the most money of any team on player salaries this season, totaling $112.7 million ($91.3 million on player salaries and $21.4 million on ", ").", " The Lakers once again sold out all 41 home games for the season at ", ".", "The Lakers clinched the ", " for the 31st time in franchise history. Despite winning eight games less than the previous season, they still held the top seed in the ", " playoffs and made it to the NBA Finals for the third straight season. In the ", " the Lakers defeated the ", " in a rematch of the ", " won by the Celtics. This time, the Lakers won the series 4-3 for their 16th NBA title and handed Boston its first Game 7 loss in an NBA Finals in team history. ", " won his second consecutive ", ".", "On July 14, 2009, ", " won the ", " for Best Coach/Manager while Kobe Bryant won for Best NBA Player.", "The Lakers came into training camp with no serious injuries. All players were expected to be healthy enough to play in the season opener. After having surgery on his knee last season, ", " was told that he has ", ", which required him to wear a knee ", " for the entire season.", "During training camp, ", " was not able to participate fully in practice due to a \"malalignment of his hips/hip flexors\". The imbalance was causing him pain in his abdominal, groin and hip flexor areas.", " He made a full recovery and played on opening night. ", " injured his ", " during a preseason game and missed the first 12 games of the season. In December, ", " revealed that he suffered a shoulder injury during the Lakers' opening exhibition game. He kept the injury quiet so it wouldn't seem like he was making excuses, telling neither the media nor his coaches.", " chose not to sign when the Los Angeles Lakers offered the Mid-Level Exception (approximately $6 million per year).", " When the Lakers looked towards other free agents, Ariza agreed to sign with the ", " for slightly more money. The Lakers had a ", " on ", " to pick up his contract for one year paying him $736,000.", " But the Lakers decided to release him to keep the roster to 13 players.", " Sun eventually signed with the ", ".", "Assistant coach ", " left the Lakers to pursue a head-coaching position with the ", ". Rambis was believed to be the potential replacement to ", " if he leave in the next season.", "The Lakers had ", " to exercise contracts on ", " and ", ". The Lakers decided to bring both Powell and Mbenga back, paying them $959,000 each.", " ", " also had an option to terminate his contract this offseason, which would pay him approximately $23,000,000 for the season and $24,800,000 for the season after. He chose not to opt out of his contract and will sign a 3 year extension worth between 80 and 85 million dollars.", " was the first player from another team to sign with the Los Angeles Lakers this offseason. On July 2, Artest told ", " that he has agreed to a contract with the Lakers. He decided not to pursue a more lucrative contract from his former team (the Rockets) and signed a 5-year deal worth $33 million on July 8.", " The Lakers used their ", " to sign Artest. Artest has long wanted to play for the Lakers and was looking forward to playing with ", " and childhood friend ", ". Artest changed his jersey number from 96 to 37 in honor of ", "'s album ", " which was the #1 selling album for 37 weeks.", " Jackson died 13 days earlier.", " agreed to a contract with the Lakers on July 6. Brown turned down a more expensive offer from the ", " and agreed to a 2 year $4.2 million deal.", " The Lakers used the ", " to sign Brown. He has a ", " to terminate his contract after the 2009-10 season.", "Lamar Odom was the last Lakers free agent to resign with the team. Before the previous season ended, Odom said he was willing to take a paycut from the $11.4 million he made in his final year of his contract (which was actually $14.1 million under the Lakers salary cap because the difference was paid upfront as a \"trade-kicker\" when he joined the Lakers). Early in July, the Lakers presented two offers to Odom:", "When Odom and his agent did not respond quickly enough, owner ", " pulled both deals off the table. At the same time, the ", " actively pursue Odom. Heat President ", " and ", " met with Odom in Los Angeles in an attempt to get Odom to return to Miami.", " Afterwards, Odom spoke with Jerry Buss, and Odom's agent and Lakers General Manager Mitch Kupchak kept an open dialogue. On July 30, Lamar Odom agreed to a four-year deal, reportedly for $33 million, with a ", " for the final year. Odom said he did not want to leave ", ", ", ", ", " and the rest of the Lakers, especially ", ".", "On September 28, the Lakers signed four players to non-guaranteed contracts: ", ", ", ", ", ", ", " and ", ".", " On September 30, the Lakers also signed ", " to a non-guaranteed contract,", " bring their total player roster to 18 players. By the beginning of the season, they had to reduce their roster to a maximum of 15 players. On October 10, the Lakers cut Mickaël Gelabale, David Monds, and Michael Fey, bringing the roster to 15 players.", " On October 21, Thomas Kelati was cut from the team.", " On October 24, the Lakers cut Gaffney.", "The Lakers traded their first round draft pick (#29) to the ", " for $3,000,000 and the Knicks 2011 second round draft pick.", " The Lakers traded their second pick (originally from the ", " for the ", " trade) for cash.", "The Lakers originally had three picks entering the Draft. Their 29th pick was used to pick ", " from ", ", and chose ", " from ", " with their 42nd pick, a pick which they got from a previous trade with Charlotte.", " The Lakers traded both each for a 2011 second-round draft pick and cash. They kept their final pick and selected ", ".", " The ", " center earned All-", " honors last season after averaging 9.8 points and a team-best 7.3 rebounds and 53 blocked shots. He set a school record by making 66.5 percent from the field and was named the Big 12's most improved player.", "The Los Angeles Lakers opened the season at home against their intra-city rival the ", ". Before the game, the remaining Lakers on the team from last year received their 2009 NBA championship rings. ", " missed the first 11 games due to his ", " injury, so Lamar Odom moved to ", " and was placed in the starting lineup.", " The season opened with the starting lineup being:", "The Lakers started off 7–1, then lost two in a row. ", " was another player who was injured, suffering a pinched nerve in his back on November 16.", " He was out for approximately six weeks.", " However, Gasol came back soon after and the Lakers returned to their normal lineup (with Odom coming off the bench):", "Through the first 14 games of the season, the Lakers ranked second in the league in defensive field-goal shooting (41.7%).", " They also had to deal with poor play by reserve players.", " After Gasol's return, the Lakers went 10–0, which included a game on December 4 when Bryant made a three-pointer as time expired to lift the Lakers past the ", " 108–107.", " Their 11-game winning streak ended on December 12 against the ", ". On December 11, Bryant suffered a fracture in his right index finger in a game against the ", ",", " but it didn't force him to miss any games. On December 16, Bryant made another game-winning shot, this time against the ", " in overtime. The Lakers went on a five-game winning streak heading into their Christmas Day game at home against the ", ". They lost the game for their third home defeat of the season. Later that night, Ron Artest suffered a concussion from tripping over a box and falling down a flight of stairs.", " He missed five games to recover. The Lakers struggled with his absence, giving up 100 or more points in four consecutive games. On January 1, Bryant made a three-pointer at the buzzer to beat the ", ".", " It was the third time that season that Bryant made a buzzer-beater to win a game. On January 3, Gasol mildly strained his left hamstring in the first quarter against the ", " and had to leave the game.", " Artest returned to play the next game versus the ", ", and Odom almost recorded a ", " with 17 points, 19 rebounds, and 9 assists.", " After Christmas, the Lakers struggled, going 6–5. Since then, both Walton (28 games) and Gasol (six games) returned from injuries and the Lakers played with a full roster for the first time that season against the Clippers on January 15.", "On January 21, the Lakers began the second half of the season by playing eight consecutive road games in 12 days. Beginning with a rematch of the Christmas Day game against the Cavaliers and concluding on February 1 against the ", ", the defending champions also visited the ", " to meet President ", ".", "Against the Memphis Grizzlies, Bryant surpassed ", " to become the Lakers' all-time leading scorer. The Lakers finished the road trip 5–3. In February, Gasol was named winner of two of the three most prestigious annual awards given to European players, based on performances during the 2009 calendar year for both national and club teams. On December 27, Gasol was announced by the ", " magazine ", " as the winner of its ", " award", " and on December 28, Gasol was announced by the Italian sports newspaper ", " as the winner of its ", ".", " On February 6 against the ", ", an injured Bryant sat out for a game for the first time since 2007. Odom matched a career high with 22 rebounds in the Lakers' win, the first time they had won in Portland since 2005.", " Gasol produced 21 points, 19 rebounds, eight assists and five blocks in a win on February 8 against the ", ", joining five other players to accomplish the feat.", " The Lakers headed to the All-Star break on a three-game winning streak. All three victories came without Bryant and the final two were without Bynum.", "Bryant was voted as a starter for the ", ", but sat out due to injury. Gasol was selected as a reserve for the West and logged 13 points and six rebounds in 20 minutes.", " Brown entered the dunk contest but was defeated in the second round.", "Bryant returned from injury on February 23 against the ", ". The Lakers went 4-1 without him. Bryant made a three-pointer with 4.3 seconds left to lift the Lakers to a 99-98 victory. However, the Lakers went 4-4 in the eight games after Bryant's return.", " Since the All-Star break, the Lakers have struggled, recording a 5-5 record including the first three-game losing streak since Gasol joined the team in a trade two years earlier.", " The team also had to deal with injuries to ", " and ", ".", " The Lakers responded by winning five games in a row, but Bynum suffered an injury and was removed from the active roster.", " It was revealed that Bynum strained his ", " against the ", " on March 19, and that he was expected to miss almost two weeks (six games) to recover.", " After their three-game losing streak, the Lakers responded by winning seven games in a row, then lost two of their next seven. They were the eighth best team in the Western Conference between the All-Star break and April 5 by record, but still held the top seed.", " Bryant chose to miss three of the final four regular-season games to recover from injuries.", " Bynum returned from injury for the first game of the playoffs.", "The Lakers played the ", " in the first round of the playoffs. Both Bryant and Bynum returned from injury to start in the first game. In game one, the Lakers outscored the Thunder 27-13 in the first quarter. The Thunder attempted to close in on the lead, but the Lakers held on in the 2nd half, matching the Thunder's point total in the 3rd and 4th quarter. Although Bryant led the Lakers in points scored (21), Gasol had the most impressive night statically, collecting 19 points, 13 rebounds, three assists, and three blocks. The series went to ", " for games three and four. The Thunder won both games including a 21 point win in game 4. ", " averaged 30.5 points in the two games to lead the Thunder. During the two games, the Thunder used their speed to run on the Lakers which translated into 24 fast-break points and 23 second-chance points in game 4.", " In game 5 in L.A., Gasol and Bynum combined for 46 points, 22 rebounds, and six assists in a 111-87 win.", " Game six saw the Lakers returning to ", " were they could clinch the series with the win. The Lakers' bench outscored the Thunder's 30-16, however the Thunder claimed a one point lead with 3:04 to play.", " With time winding down, Gasol caught an offensive rebound off of a missed jump shot by Bryant and scored a layup with 0.5 seconds remaining in the game for the win.", "The Lakers next opponent was the ", " who advanced to the second round of the playoffs by defeating the ", " 4-2. This was the third straight year the two teams met in the playoffs. The Lakers started off the first quarter shooting 79.8% from the field,", " and leading by 10 at half time.", " The Lakers gave up the lead in the 4th quarter before Bryant scored 11 points in the final four minutes to lead the Lakers to a 104-99 victory.", " Although Bryant had the most successful night in game 2, it was the Lakers front court of Gasol, Bynum, and Odom who dominated the game.", " Each had at least 11 points, 14 rebounds, and two blocks while the team outrebounded the Jazz 58-40 to a 111-103 victory.", " ", " returned in game 3 from more than a month out with a strained left calf. While the Lakers' big men were dominate in the first two games, they had to rely on their backcourt in game 3 with Bynum and Odom being held in check.", " Jazz coach ", " said the Jazz's effort to keep the Lakers out of the middle opened up some 3-point shots and Los Angeles capitalized.", " Artest scored 18 of his 20 points in the second half while overcoming his three-point range slump in the playoffs.", " The fourth quarter had 12 lead changes, including Bryant and Fisher making back-to-back 3-pointers during an 8-2 run in the final minute.", " In the final four seconds, ", " missed a shot and ", " rebound and tip missed just before the end of the game.", " The Lakers won 111-110 and were on the verge of sweeping the Jazz. In game four, the Lakers jumped ahead and led by 22 points in the first half. The Jazz opened the third quarter with an 11-2 run and were able to cut the lead to 70-65, but the Lakers responded by finishing the period on a 10-2 run and led 80-67 at the end of the third quarter.", " The Lakers led by 10 for most of the 4th quarter. Coach Phil Jackson called it \"the first really consistent game we have played...We controlled the game and forced our will on our opponent.\"", " Bryant scored at least 30 points in all four games and the Lakers swept the series 4-0.", "The Lakers then faced the ", " in the Western Conference Finals. In game 1, the Lakers blew out the Suns 128-107 led by Bryant's 40 points including 23 in the third quarter.", " Odom came off the bench to tally 19 points, 19 rebounds, and three assists.", " In game 2 Bryant played the role of facilitator, putting up 13 assists, while Gasol recorded 29 points, 9 rebounds, and five assists.", " The teams were tied at 90-90 heading into the fourth quarter, but Bryant and Gasol led the fourth quarter rally and the Lakers won the game 124-112.", " Game 3 was played in Phoenix, where the Suns used their big men and physical play to win the game.", " ", " scored 42 points and grabbed 11 rebounds while ", " 20 points.", " Odom and Bynum, however, both picked up fouls early and were ineffective for the Lakers for most of the game. The Lakers only scored 15 points in the second quarter and were down 86-84 in after three quarters. The Lakers were able to take the lead 90-89 with 8:47 to play, but the Suns rallied back to win 118-109. After battling each other in game 4 and slugging out a 23-23 first quarter, the Suns erupted for a 41 points in the second quarter, shooting 74%.", " Early in the 4th quarter the Lakers led 87-85. However, the Suns reserve players (who outscored the Lakers reserves 54-20) produced and 18-3 run in the 4th which the Lakers never recovered from despite Bryant's 38 points and 10 assists.", " In game 5, the Lakers surged to a 16 point lead in the first half including a 21-4 run and led by 18 points by half time. Steve Nash, who had 29 points and 11 assists in the game, led the Suns to a 16-4 rally in the third quarter to trim the lead to six by the end of the period and one with 2:52 left in the game.", " ", " made a three pointer with 3.5 seconds left in the game to tie the score 101-101.", " On the next possession, Bryant, who had 30 points and 11 assists in the game, air-balled a three, but Artest offensively rebounded and made a game winning layup as time expired.", " In game 6 in Phoenix, the Lakers had the lead for most of the game. Los Angeles outscored the Suns 23-10 over the last eight minutes of the second quarter to lead 65-53 at the break and were up by 17 entering the fourth. However the Suns went on a 16-4 run and cut the Lakers lead to 95-90 with 6:09 remaining in the game.", " Artest scored 25 in the game and Bryant had a 37 point performance including nine points in the final two minutes to win the game 111-103 and clinch the series 4-2."], "title": ["2009–10 Los Angeles Lakers season - Wikipedia, the free encyclopedia"]},
{"content": [], "title": ["\nNBA: Dominant Spurs not ready to seize championship rings | Sports | GMA News Online"]},
{"content": ["The ", " is the championship series of the ", ". The series was named the ", " until 1986.", "The series is played between the winners of the ", " and ", " ", ". At the conclusion of the championship round, the winners of four (4) games of the NBA Finals are awarded the ", ". (Winners from 1946 to 1983 received the ", " redesigned in 1977 to the current form.) The NBA Finals has been played at the end of every NBA and ", " season in history, the first being held in ", ".", "Between 1985 and 2013, the winner of the NBA Finals was determined through a 2–3–2 format: the first and last two games of the series being played at the arena of the team who earned home court advantage by having the better record during the regular season. Most NBA Finals series were played under the 2–2–1–1–1 format prior to 1985; the Finals will return to this format starting in 2014.", "During the first decade the ", " had the first NBA dynasty, winning five championships in six years under ", " head coach ", ". The team also featured ", ", one of the greatest players in NBA history.", "The ", " went 11–1 in the NBA Finals during 13 seasons (1956–67 to 1968–69). They won eight straight NBA championships from 1959 through 1966.", "The Celtics and Lakers made up 19 of 26 possible NBA appearances during thirteen seasons (1956–67–1968–69). The two teams met six times during the eight years Boston won the NBA in a row.", " This period includes one season (1958–59) when the Lakers were still in Minneapolis, and it marks the largest stretch of seasons (14) that two teams made up over 65% of NBA appearances, second being the 10 seasons (1979–80 to 1988–89) the Celtics and Lakers appeared 13 times.", "With the establishment of the Celtics dynasty in 1957, ", " became the star of the league. Game 7 of the NBA Finals was decided on a Celtics basket in the final seconds of the second overtime. For most of the late 1950s and 1960s, the Celtics always seemed to have the upper hand on ", "'s teams.", "In 1964, ", ", who had moved to the state of California with his team, the former Philadelphia Warriors, led the ", " to a Western Conference championship, but again failed to conquer the Celtics. The following season, he joined the ", ", the former Syracuse Nationals team that had moved to cover the vacancy created with the departure of the Warriors.", "A clash between the two stars in the playoffs was in 1966 and Boston won it 4–1. Chamberlain's coach told him to play a team game, not an individual game, and thus avoid drawing double-teams. His new-found team spirit brought them to a new record of 68 wins the following season, and they defeated the Celtics and then advanced to, and won, the Finals.", "In 1968, Boston overcame a 3–1 deficit against Philadelphia to once again arrive in the Finals. They went on to defeat the ", " for the sixth straight time, 4 games to 2.", "In 1969, the Celtics overcame even longer odds. Boston was an aging team and had injuries to a number of players. They barely qualified for the playoffs, finishing fourth in the East. The Lakers, who in the offseason added Chamberlain to join West and Elgin Baylor, won the West and were prohibitive favorites to finally win it all for the first time since relocating to L.A. They won the first two games at the ", ". However, when the series shifted to ", ", the Celtics won Games 3 110–105. Game 4 was the turning point, as the Lakers led 87-86 and had the ball with 10 seonds to play. But after a turnover, Sam Jones put up a shot that hit the front of the rim, the back heel, rolled around, and went in, giving the Celtics an 88-87 win and tying the series. Game 5, played at the Forum, returned the advantage to the Lakers, but Game 6 was a 99–90 Celtics win, with Chamberlain scoring just eight points. Game 7 was held on May 5; Lakers owner ", " had balloons hung up in the arena in anticipation of a Lakers victory. When ", " saw the balloons he was furious, while Russell immediately used the balloons as an inspiration for his team. With West nursing a sore thigh and hamstring, Russell ordered his team to fast break at every chance and they raced off to an early lead. They held off a furious Lakers comeback to win 108–106 and win the series, their eleventh championship in 13 years. This game represented the final one of the Celtics' dynasty.", "The 1970s saw eight different teams win the title, with the Celtics and Knicks winning twice.", "In ", ", a classic final featured the ", " against the Lakers. In the waning moments of Game 3, with the series tied, Jerry West hit a basket from 60 feet to tie the game, a shot which became one of the most famous ever. Although the Knicks won in ", " and continued their momentum for a 4–3 win, the Lakers were not defeated. Just two seasons later, the team won 33 straight games, the longest such streak in NBA history. By season's end, they broke the record for most wins in a season with 69, one more than the 1966–67 76ers. The Lakers finally, after a tough postseason, took home the ", " for the first time since the Minneapolis days. The Knicks won the championship again in ", ", using much the same formula, for their second franchise victorious season.", "The ", " went back to the Celtics as the remaining players demonstrated excellent teamwork and resilience in the Finals.", "The late 1970s were characterized by a major breakthrough of the league's western franchises. In 1975, after compiling a 48–34 regular-season record, the ", " swept the heavily favored Washington Bullets 4–0 in the ", ".", "1976 saw the rise of the ", ". Only eight years in existence, they overcame a losing record early in the season to build remarkable win streaks to finish 42–40. The events culminated in upset victories over Seattle and Golden State. In the final against Boston, the teams split the first four games. Game 5 went into three overtimes but eventually went to Boston 128–126. Two days later, the Celtics finished Phoenix off 87-80 in Game 6 for their 13th championship.", "Other western franchises that won their first titles in the late 1970s included the Portland Trail Blazers in 1977 and the Seattle SuperSonics in 1979. Portland's victory was against the heavily favored Philadelphia 76ers led by Julius Erving. Although the Washington Bullets were able to defeat Seattle in the 1978 NBA Finals, Seattle was able to prevail the following year against the Bullets to win its first NBA title.", "Between 1980 and 1989, the Celtics and/or the Lakers played in every NBA Finals.", " The Lakers won five titles from 1980-1990 (1980, 1982, 1985, 1987, and 1988); the Celtics won three (1981, 1984, and 1986); the Pistons won twice (1989 and 1990); and the Sixers won once (1983).", "The 1979 ", " featured ", "'s ", " team facing off against ", "'s ", " team. Michigan State won. This meeting has been immortalized; in fact, it attracted the largest ever TV rating for an NCAA Championship game, with 38 percent of all television viewers that night tuned to the game.", "Bird had actually been drafted the year before, but later decided to stay one more year, and the two superstars entered the league in 1979, leading their respective teams to dazzling heights. Johnson's Lakers reached the ", " against Julius Erving's 76ers, and took a 3–2 lead, but ", " could not play in Game 6 due to injury. Johnson shifted to center, ended up playing every position on the court and scored 42 points to win his first championship, a remarkable performance in the annals of the sport.", "Boston reached the ", " led by the \"Big Three\" of Larry Bird, ", ", and ", ". During the ", ", the Celtics traded two first round picks to the Warriors for Parish and a first round pick later spent on McHale. Considered to be one of the best Front Courts of all time, all three players would later make the NBA Hall of Fame. They met the Rockets in the 1981 Finals, practically single handily carried by Moses Malone who upset Magic's Lakers in the first round. The Rockets were only the second team in NBA history to make the Finals after posting a losing record in the regular season, and the Celtics had an NBA best record of 62-20. After reasserting themselves as a Powerhouse in the NBA, the Celtics won the Finals in 6 games.", "Led by new coach ", ", the Lakers returned to the ", " in a rematch against the 76ers. The 76ers had barely managed to defeat the Celtics in the Eastern Conference finals, as the series went to 7 games. However, the Lakers were able to dispatch of the 76ers in 6 games, with Magic Johnson being named Finals MVP. Philadelphia, losing their past three NBA Finals appearances, decided that they needed one more piece to become a champion. On September 15, 1982 they traded for NBA-MVP Moses Malone.", "Philadelphia, led by ", " and ", ", won the ", ", losing only once in the entire playoffs, and sweeping the Lakers. (Malone had predicted earlier that they would sweep every series in \"Fo-Fo-Fo\".) However, in the ", ", the Celtics and Lakers met for the first time since 1969, and again, from Bird's performance, the Celtics toppled the Lakers 4–3. Game 7 attracted the largest TV audience ever for an NBA game, and the second-largest ever for a basketball game, with only the game between the two stars played five years earlier having a larger audience. It was the last NBA Finals played in the 2–2–1–1–1 format until 2014.", "In the ", ", the Lakers made amends for their previous eight losses to the Celtics by defeating them in six games. After losing the first game in a rout, 148–114, dubbed the \"", "\", they won 4 out of 5, including Game 6 in Boston Garden, to finally end the long years of frustration of failing to defeat the Celtics. These finals were the first to be played in the 2–3–2 format, which Red Auerbach suggested to David Stern in order to cut back on the frequent traveling between Boston and Los Angeles.", "The ", " brought the Celtics back against the Rockets. Boston won in six games, taking their 16th title, with the MVP award going to Larry Bird, his second Finals MVP trophy.", "In ", ", the Lakers and Celtics met again for a rubber match. Both sides had won one series, and now a third was being played. The Lakers won the first two games, but Boston won Game 3. In Game 4, Magic Johnson hit a sky-hook with two seconds left to give the Lakers a 107–106 win and a 3–1 series lead. They lost Game 5, but won Game 6 to take the series.", "In 1988 and 1989, the aging Celtics failed to reach the Finals, with the Lakers and Pistons becoming the best of their conferences. The ", " went to L.A. 4–3, but the Pistons swept the Lakers in ", ". In ", ", Detroit beat the Blazers in five games, and the name \"Bad Boys\" became attached to the team for its rough, physical play. Led by a Hall of Fame back court in ", " and ", " and a rough, physical front court with Dennis Rodman and ", ", the Pistons were able to fight past the up-and-coming superstar of Michael Jordan and the Chicago Bulls.", "The majority of the 1990s was marked by the ", "' dynasty, which ended in 1998. Coached by ", " and led by superstar ", ", the Bulls won 6 titles from 1991 to 1998. Supported by ", " and ", ", Jordan won the Finals MVP award every time.", "The first championship came at the expense of the Los Angeles Lakers, the last appearance in the Finals for ", ". Billed as a showdown between the aging Magic and the upstart Jordan, the Lakers won the first game 93-91. For the rest of the series, Pippen would guard Magic, with Chicago ultimately taking the next four games. The Bulls returned to the Finals in the next year, pit against ", " and the ", ". Throughout the 1991-1992 season, Jordan and Drexler led their teams to the best record in their respective conference, leading to several comparisons between the two players in anticipation of a postseason match-up. Chicago blew out the Trail Blazers in Game 1, a game most famous for Jordan shrugging after his record breaking sixth three-pointer in the first half. Game 2 went into overtime, with the Trail Blazers outscoring the Bulls 18-7 in the final period to run away with the win. Game 3 and 4 were split between Chicago and Portland, respectively, but the Bulls took the final two games, clinching their second championship.", "In 1993, Jordan was matched against his close friend, MVP ", " of the ", ". The Bulls won the first two games in Phoenix convincingly, with 100–92 and 111–108 as the final scores respectively. The Suns, rallying behind Barkley, won Game 3 129–121 in Chicago in triple overtime. The Bulls took Game 4 111–105, with Jordan scoring 55 points and tying Rick Barry for the second-most amount of points in an NBA Finals game. Before the Bulls could celebrate, however, the Suns won Game 5 108–98, sending the series back to Phoenix. Chicago won the series clincher in Game 6 99–98 on ", "'s 3 pointer, leading the Bulls to become only the third team in history to ", ".", "Known as Clutch City, the ", ", led by ", ", won the 1994 and 1995 NBA title. Olajuwon dominated during those two seasons, becoming the only player in history to win the ", ", ", " and NBA Finals Most Valuable Player Award in the same season (1993–94). It was the only year that the NBA and NHL finals went 7 games, but also involve teams from one city. The Rockets' win in Game 7 denied New York from having NBA and NHL titles in the same year, as the ", " won the ", " during the series. The Rockets swept the ", " in the 1995 Finals; Olajuwon was named again Finals MVP. The Rockets became only the fifth franchise to win back-to-back titles. Notably, Portland's Drexler was on the 1995 Rockets team.", "After a short stint as a baseball player, Jordan returned to basketball late in the 1994–95 season (March 18). Although he did not lead the Bulls to the Finals, he returned to pre-retirement form the next year while the team acquired Dennis Rodman, leading the Bulls to one of the most memorable seasons ever. The ", " finished the regular season 72–10, the best regular season record in NBA history. They dominated in the playoffs, with series records of 3–0, 4–1 and 4–0, before facing off against the ", " in the NBA Finals. Although the Bulls took a 3-0 series lead, Seattle won the next two games after coach ", " switched point guard ", " onto Jordan, leading to a sixth game before the Bulls could close it out.", "In 1997 and 1998, the Bulls met the ", " in the Finals two times. Led by ", " ", " and ", ", the Jazz were defeated in both Finals by the Bulls in six games. In both series, Chicago won by hitting winning shots in the sixth and deciding game-the first by ", " in 1997 in Chicago and the second by Jordan in Utah in 1998. Although Jordan, Pippen and Jackson were the only three involved in all 6 titles, the Bulls dynasty had a cast of characters that were decisive in obtaining them. ", ", ", ", John Paxson, ", " and other supporting cast members were pieces added to the puzzle to create the first three-peat. Of the second, little-known players such as ", ", ", ", ", ", ", " and ", " were key factors who rarely produced an astounding amount of points, but proved crucial via setting picks, rebounding, creating turnovers, etc. Before the beginning of the 1999 season, Jackson decided to retire, which set off a chain reaction that resulted in most of the team, including Jordan and Pippen, to leave the Bulls. With no foundation of youth to build upon, the Bulls would be ", " for the next 6 years.", "The ", " and ", " combined to win 11 of the 12 Western Conference titles and nine NBA Championships during this period.", "The Spurs won four championships during this period, in 1999, 2003, 2005, and 2007. In the 1999 NBA Playoffs, the Spurs finished with a 15–2 mark, including sweeps of the Blazers and Lakers. With a defensive squad led by ", " and ", ", San Antonio's 84.7 points allowed per game was the fewest average points allowed in the post-season in the last 30 years. In the ", " that year, the Spurs held the ", ", the first #8 seed team to reach the finals in NBA history, to an average of 79.8 points per game. From 2003 to 2007, San Antonio would win three more championships in five years, but never repeated as champions. During the ", ", the Spurs defeated the Nets in 6 games. Said Finals also marked the first championship contested between two former ABA teams. In Game 6, Duncan was two blocks short of recording the first ", " in NBA Finals history, finishing with 21 points, 20 rebounds, 10 assists, and 8 blocks. The Spurs went on to defeat the defending champion Detroit Pistons 4-3 in the ", ", as well as sweeping the ", " in the ", ". Duncan won the Finals MVP in 1999, 2003 and 2005. In 2007, ", " was named MVP, becoming the first European-born player to win the award.", "From 2000–2002, the Lakers, led by ", " and ", ", won three straight NBA Championships. O'Neal won the finals MVP all three times. Their ", " came at the expense of the ", ", whom the Lakers defeated in 6 games. During their ", " postseason run, the Lakers swept their first 3 series and won the Finals in 5 games, finishing with an unprecedented 15–1 record. Their opponent in the Finals was the ", ", led by ", ". Entering the ", ", In the ", ", the Lakers swept the ", ", leading almost the entire time in each game; only for a short while after the beginning of Game 4 did the ", " gain any significant lead in a game.", "In the 2004 offseason, veteran stars ", " and ", " signed with the Lakers. Along with Bryant and O'Neal, they formed what many expected to be one of the best teams in NBA history, and were the favorites to win the championship. However, the ", ", under coach ", ", upset the Lakers in 5 games. ", " was named the Finals MVP. The Pistons were also the first team to win games 3, 4, and 5 at home in the Finals since the series switched to a 2-3-2 rotation in 1985, a feat that has since been repeated by the 2006 and 2012 Miami Heat. Now established as one of the premier powerhouses of the East, Detroit would return to the NBA Finals in the following year, bowing out to the Spurs in seven games.", "The ", " were the only Finals between 1999 and 2010 not to feature the Spurs or Lakers. Instead, it featured the ", " and ", ". It was the first NBA Finals since 1971 that had both Western and Eastern Conference champions making their first Finals appearance in franchise history. The Mavericks won the first two games at home, but the turning point of the series was in Game 3, when the Heat overcame a 13-point deficit with less than 6 minutes left in the fourth quarter to win 98–96. The comeback was led by Wade's 12 points in the final six minutes and a clutch outside jumpshot by ", ", who was appearing in his third NBA finals. Miami swept all three of their home games, two of which were sparked by fourth quarter comebacks led by Wade; the Heat would win their first championship in game six.", "The Lakers returned to the finals in 2008, against the ", ". Renewing the teams' fierce rivalry of the 1980s, this marked the 11th time that these two teams met in the Finals, the last such meeting happening in 1987. The Celtics, who defeated the Lakers 4-2, were led by their \"Big Three\" superstars: Long-time Celtic and Finals MVP ", ", and first year Celtics ", " and ", ".", "The Lakers bounced back from their 2008 loss and returned to the Finals in 2009, where they faced the ", ", led by ", " ", " in ", ". Los Angeles would defeat Orlando in five games, with Bryant earning the Finals MVP award. The Lakers met the Celtics once again in ", ". The Lakers trailed 3-2 before winning the last two at home, marking the first time in the history of the Celtics franchise that Boston lost a Game 7 in the NBA Finals. ", " was named Finals MVP once again. The 2009 and 2010 titles were Lakers' coach ", "'s 10th and 11th NBA titles, passing ", " for the most NBA titles all time. Jackson would also pass Auerbach and ", " coach ", " for the most titles for a head coach in any major American sport.", "During the 2010 offseason, the ", " added free agents ", " and ", ", who along with team captain ", ", formed what many dubbed the \"Big 3.\" The Heat were considered by many to win the title, not just the following season, but for years to come. The Heat would represent the Eastern Conference in the next four finals, winning two of them.", "The ", " put the Heat against the ", " in a rematch of the finals from ", ". The Mavericks, who were led by ", " and ", ", ", ", and ", ", won the series 4-2, with Nowitzki being named the ", ". The Heat returned to the finals in ", " against the ", ", in a series that had 3-time ", " James and 3-time ", " ", ", neither of whom had won a championship at the time. After the Thunder took Game 1 at home, the Heat won four straight games to win the series 4-1. The Heat became the first team ever to win a championship after trailing in three different series. James was unanimously named NBA Finals MVP. The Heat won a second title in 2013, this time over the ", ". The 2013 Finals was the first Finals since 1987 to feature four former Finals MVPs: ", " (1999, 2003, 2005) and ", " (2007) for the Spurs and ", " (2006) and ", " (2012) for the Heat. The Spurs were up 3-2 in the series going into Game 6 at the American Airlines Arena in Miami. With seconds remaining in regulation, Miami's ", " scored a game-tying three-pointer to send the game into overtime,and the Heat would prevail 103-100. The game is considered by some to have been one of the greatest playoff games in NBA history.", " The Heat would win Game 7, 95-88, to clinch the title. James was named the Finals MVP for the second straight year.", "Looking for a ", ", the Heat dominated the ", ", going 12-3 in the first three rounds. They have made the ", " and will face off against the San Antonio Spurs, once again in a rematch of the ", ". The Spurs will have home-court advantage since they ended the regular season with a better record.", "The statistics below refer to series wins and losses, not individual games won and lost.", "The statistics below refer to series wins and losses, not individual games won and lost."], "title": ["NBA Finals - Wikipedia, the free encyclopedia"]},
{"content": ["The ", " was the ", " season of the franchise, the 56th in the ", " (NBA), and the 47th in the ", " area. The Pistons were able to finish 2nd overall in the Central Division, behind the ", ". Led by new coach ", " and boosted by the trade deadline acquisition of forward ", ", the Pistons advanced to the ", ", where they defeated the heavily favored ", " in the four games to one, winning their third overall championship and first since 1990.", "(3) ", " vs. (6) ", ": ", ": ", " (Detroit won 4-1)", "(2) ", " vs. (3) ", ": ", ": ", " (New Jersey won 4-0)", "(1) ", " vs. (3) ", ": ", ": ", " (Detroit won 3-0)", "(OT) denotes a game that required ", ".", "The Finals were played using a 2-3-2 site format, where the first two and last two games are held at the team with ", ". This is only used in the Finals, all other playoff series are held in a 2-2-1-1-1 format (the team with home court advantage starts).", "The Lakers had a lineup of stars such as ", ", ", ", ", ", ", ", and ", " - their offensive capability was expected to overpower Detroit's defensive-based gameplan.", "Payton and Malone also added to the publicity of the Finals. Perennial ", " who had both previously reached the Finals, Payton had led the ", " there in ", ", while Malone had led the ", " there in ", " and ", ".", " However, ", " and the Bulls denied their championship rings a total of three times. By the time of Jordan's retirement in 2003, the two veterans were aged and failed to lead their teams deep into the playoffs.", " Thus, this Finals series was seen as the last chance for two of the greatest players in NBA history to finally become NBA champions (Later on, Malone retired while Payton became a champion as a key bench player for the ", ").", "Considered to be a stunning upset by most of the NBA world, the Detroit Pistons managed to defeat the Lakers with imposing defense.", " Defensively clamping down on everyone but Bryant and O'Neal, the Pistons managed to hold everyone else to a total of 16 points.", "The Pistons trailed the Lakers 41–40 at halftime, but a 10–4 surge capped by Billups's 3-pointer gave the Pistons the lead. O'Neal's foul trouble furthered the scoring gap, with the Pistons leading by 13 points early in the fourth quarter.", "The second game was close throughout the first half, but in the third quarter Detroit would score 30 points, cutting the deficit 68–66. However, at the end of the fourth quarter, Kobe Bryant's 3-point shot at 2.1 seconds to go would tie the game at 89–89. The Lakers and Pistons would then go to overtime, with the Lakers outscoring the Pistons 10–2.", "The Pistons beat Los Angeles by 20 in their first NBA Finals appearance together at The Palace of Auburn Hills since 1989", " to take a 2–1 lead in the series. The 68 points scored by the Lakers set a (post-", ") franchise record for the fewest number of points scored in a playoff game. (Even ", " was upset, saying in his ", " monologue: \"68 points? 68 is a great score...if you're playing ", "!\")", "Again, the Pistons defeated the Lakers, although this time by eight, to take a 3–1 series advantage.", "In Game 5, the Pistons won their first championship since 1990, and Larry Brown finally won a title as an NBA head coach. The Pistons defense had overcome the high-scoring Laker offense, winning the game by 13, winning the series 4-1, and also ending a long Laker dynasty that lasted for many years. The game saw the end of Phil Jackson's first run as the coach (he returned for the 2005-06 season), and saw O'Neal, Payton, and Malone's last games in Laker uniforms (O'Neal and Payton were both acquired by the soon-to-be NBA Champions ", " and Malone retired).", "* Statistics include only games with the Pistons"], "title": ["2003–04 Detroit Pistons season - Wikipedia, the free encyclopedia"]},
{"content": ["The ", " (formerly ", " from 1946–49) ", " is the championship series for the NBA and the conclusion of the sport's ", ". All Finals have been played in a ", ", and contested between the winners of the ", " and the ", " (formerly Divisions before 1970), except in ", " in which the Eastern Division champion faced the winner between the Western and ", " champions. Prior to ", ", the playoffs were instituted a three-stage tournament where the two semifinal winners played each other in the finals.", " The winning team of the series receives the ", ".", "The home-and-away format in the NBA Finals is in a 2–2–1–1–1 format (the team with the better regular season record plays on their home court in Games 1, 2, 5 and 7). It was previously in a 2–3–2 format (the team with the better regular season record plays on their home court in Games 1, 2, 6 and 7) during ", " and ", "–", ", ", "–", ";", " in a 1–1–1–1–1–1–1 format during ", " and ", ";", " in a 1–2–2–1–1 format during ", " and ", ".", "The Eastern Conference/Division leads the Western Conference/Division in series won (37–29). The defunct Central Division won one championship. The ", " alone own almost half of the titles, having won a combined 33 of 67 championships. The current NBA champions are the ", ".", "The trophy was originally referred to as the NBA Finals trophy,", " but was renamed in ", " after ", ", the original owner of the ", " who was instrumental in merging the BAA and the ", " into the NBA in 1949.", "The originally designed trophy was awarded to the BAA/NBA champions from 1949 to ", ". The trophy was kept by the winning team for one year and given to the winning team of the following year's finals, unless the previous team won again, much like the ", " ", ", which continues that tradition to this day.", "A new trophy design was created for the ", ", although it retained the Walter A. Brown title. Unlike the original championship trophy, the new trophy was given permanently to the winning team and a new one was made every year. It was renamed the ", " in ", " to honor former NBA ", " ", ".", "The inaugural winner of the trophy were the ", ", who defeated the ", ".", " The Boston Celtics won the trophy 14 times, the most in league history. From 1957 to 1969, they won the NBA Finals 11 out of 13 times, including eight consecutive wins. The final recipient of the trophy was the ", ", who defeated the ", " in the ", ".", "As mentioned above, the trophy was renamed to the Larry O'Brien Championship Trophy in 1984 in honor of Larry O'Brien, who served as the NBA commissioner from 1975 to 1983.", " The trophy is made out of 14.5 pounds of sterling silver and ", " with a 24 karat gold overlay, and stands 2 feet (0.61 m) tall. It is designed to look like a basketball about to enter a net. The year and team names are engraved on the trophies, and are often prominently displayed in the team's arena.", "The ", " were the inaugural winner of the renamed trophy in 1984 defeating the ", " in seven games (4–3) in the ", ".", " The Los Angeles Lakers have won the trophy eight times, and the ", " have won it six times.", " The ", " are the current holders after winning the title for the second time in a row, in 2013.", " "], "title": ["List of NBA champions - Wikipedia, the free encyclopedia"]},
{"content": ["\n\n\n", "\n", "\n\n", "\n\n\n\t", " ", "NBA Championships History, NBA MVP's and NBA Chapionship Game Results \n        provided by ChampionshipHistory.com "], "title": ["Championship History -- NBA Championship History"]},
{"content": [" ", " Posted Jul 4, 2013&nbsp4:11 PM ", " ", " A look back at every season from the league's inception in 1946 to today.", " Copyright © 2014 NBA Media Ventures, LLC. All rights reserved. No portion of NBA.com may be duplicated, redistributed or manipulated in any form. By accessing any information beyond this page, you agree to abide by the ", " / ", " and ", ". ", " ", " ", " ", " is part of Turner Sports Digital, part of the Turner Sports & Entertainment Digital Network."], "title": ["NBA Season Recaps | NBA.com"]},
{"content": ["\nWe love to compare ", " to ", ". It's become a national hobby. As a member of the sports media, I believe that anything you do, you can overdo. So let's take this a step further. Let's imagine they were interchangeable. Let's take a few facts about one man's career and apply them to the other.\n", "\nIn the 2014 NBA Finals against San Antonio, Jordan is averaging 27.3 points, 7 rebounds and 4.3 assists. Jordan is shooting 60 percent from the field, 70 percent from three-point range, and 79 percent from the free-throw line. Jordan has committed 15 turnovers against the Spurs, but he also has 10 steals.\n", "\nStill, Jordan's ", " trail 2-1, partly because Jordan did not get to finish Game 1. Oh, of course, Jordan tried his best to finish the game, despite debilitating cramps -- he literally played until his body couldn't move any more and he had to be carried off the court.\n", "\n*****\n", "\n", "\n", "\nIn the 1996 NBA Finals against Seattle, LeBron James averaged 27.3 points. 5.3 rebounds and 4.2 assists. He also shot 42 percent from the field, 32 percent from three, 84 percent from the line. He averaged three turnovers per game, and in the deciding Game 6 against the Sonics, he had as many turnovers (five) as made baskets (five, on 19 shots).\n", "\nIn fact, in the last three games of those '96 Finals, James shot 37 percent, with 11 turnovers. Nonetheless, James' ", " won, and James was once again named Finals MVP.\n", "\nJames was hailed as the greatest individual talent in history, but did not reach the Finals in his first six seasons with the Chicago Bulls. Critics said he was more concerned with scoring than winning. Only in 1991, when James's teammate ", " emerged as one of the best players in the world, did James finally win a title. James had an uneasy relationship with Pippen for a while -- he famously mocked him for having migraines during a crucial Game 7, the kind of relentless ripping that sometimes made James unpopular with his Chicago teammates. Eventually, James and Pippen became the best pair of teammates in the league, by far -- devastating opponents on offense and defense.\n", "\nIn 1993, after winning his third title with Chicago, James suddenly retired, saying he wanted to watch the grass grow. He then played minor league baseball for a while, rather than try to compete for a fourth straight title. James' Chicago Bulls won 55 games without him, thanks to an MVP-quality season from Pippen.\n", "\n*****\n", "\nIn 2010, Jordan was considered the best player in the NBA, but he had only led his ", " to one NBA Finals in his first seven seasons. Jordan then left Cleveland to join forces with ", " and ", " in Miami. Jordan carried the Heat to two of the next three NBA championships (with a third possible this week). Meanwhile, the Cavs dropped from 61 wins to 19 the year Jordan left.\n", "\n*****\n", "\n", "\n", "\nWell, well. What do we think of that? It was a little weird, of course -- pretending Jordan played for the Cavs, then left, seems like another twist of the knife in Cleveland's stomach. But mostly, the exercise reveals more about us than about Jordan or James.\n", "\nWe have compared them for years, but we don't compare fairly. We decide Jordan is superior to James, more of a true champion, and then we use the facts to support our conclusion, even when they don't.\n", "\nCan you imagine what the amateur psychologists would say if James retired from the Heat after this season, then decided to play minor-league baseball? I'm going to take a wild guess here and say he would not be praised for his mental toughness. And what if James was spotted at a casino past midnight on the night before a playoff game, as Jordan once was?\n", "\nLook, nobody has to sell me on how great Jordan was. I know. I saw it. We all did. But in the last few years, we have done something I thought was impossible:\n", "\nWe have overrated Michael Jordan.\n", "\nReally. That's what we have done. What an incredible feat, America. ", " We have taken one of the great athletes in history and declared him perfect.\n", "\nEverybody remembers Jordan's iconic shot over Utah's ", " to win his final championship. And maybe a few people point out that he pushed off, which was illegal but also a savvy veteran move; Jordan knew that with the way the game was called, and with his stature and the moment, that the refs would not whistle him for a push-off. But how many people realize Jordan missed 17 of 26 shots the game before that?\n", "\nThat is not a criticism of Jordan. At 35, he was still the best player in the world, a rare feat, and one that James will probably not be able to match. Praise Jordan all day and night. Call him the best ever, and I won't argue the point.\n", "\n", "\n", "\nStill, on some level, all this genuflecting before Jordan has sapped us of our appreciation of LeBron James. It's not just driven by self-promoting talking-heads, either; Jordan is ingrained in the minds of most NBA fans. He is the standard. And so James' 2010 defection to Miami looked even worse than it was because we are so sure Jordan never would have done it. James' accomplishments the last few years are diminished, in our minds, because we are convinced Jordan's were more impressive.\n", "\nAnd it's happening again right now. Viewed objectively, James has had a fantastic Finals. His shooting percentages are ridiculous: 60 percent from the field and 70 percent from three-point range? Those are empty-gym numbers. The cramps were unfortunate, but hardly a character indictment; reasonable, intelligent people understand that he did everything he could to play in the game. And in Game 3, when the Spurs were hitting (almost literally) every shot they took, James scored 12 straight points to at least make a comeback possible. It was a Man vs. Machine Finals game, and the Machine won, but I can't wait to see what the Man does in Game 4.\n", "\nYes, James has 15 turnovers, which is way too many. (He had seven in Game 3, part of a team-wide problem when Miami was clearly anxious to make up its huge deficit as fast as possible.) Did anybody notice he also has 10 steals? Does this matter?\n", "\nJames is such an easy target that when he says, as he did last week, that he is the \"easiest target in sports,\" people take shots at him for complaining. On some level, it's understandable. He has wealth, fame, and as much talent as any player in NBA history. It's annoying, isn't it? Worse, he seems to want everything on his side -- when ESPN reported this week that the Heat will try to add ", ", you could see millions of eyes roll.\n", "\nWell, maybe if the Cavs had drafted a player as good as Scottie Pippen to play alongside him, James would be winning championships in Cleveland right now. It didn't happen. He is in Miami. That's reality. And if you love basketball, then you can see this guy may be in the middle of an all-time great Finals.\n", "\nOn the base of the statue of Jordan at the United Center in Chicago, these words are inscribed:\n", "\n", "\n", "\n", "\n", "\nThe first line is based on observation. The second line is a religious belief. Maybe LeBron James can't compare to a deity. But I suspect he'll be sheer hell for the Spurs on Thursday night.\n"], "title": ["Comparing careers of Miami Heat's LeBron James to Michael Jordan - NBA - Michael Rosenberg - SI.com"]},
{"content": [], "title": ["NBA Finals Champions - List of NBA Champions Since 1947"]},
{"content": ["So we're 30 games in to the 2012-13 ", " season and most \"experts\" are putting together their reviews and grades for the first half of the season. I'm going to skip all of that and take us straight to NBA Finals, or at least to who I see being crowned as the champs and why they'll almost certainly be a Western Conference team.", "First, let's take a look at the Eastern Conference and what I believe will stop each of these teams from securing the Larry O'Brien Trophy this season. Rather than entertain every team, I'll look at the teams that are currently in playoff position, or the ones that I believe will be in playoff position by the time the ", " begin.", " ", " - People said that the Celtics were too old when they won it all in 2008, and despite Ray Allen jumping ship to their biggest enemy in Miami and adding some youth through the draft, this Celtics team is still too old. Paul Pierce is having a great season, but Boston's entire success is resting on Pierce's shoulders, and that didn't do so great before ", " and Ray Allen turned up.", " - Having just fired coach Avery Johnson the Nets are in a state of limbo right now. With no certainty around leadership, and with Deron Williams struggling to perform like really they need him to, it's unlikely that Brooklyn will make it to the finals this season.", " - Indiana is in a category with a couple of teams in the East with their main star injured. It is simply not the Pacers year despite the outstanding play of Paul George. With Danny Granger sidelined, so are Indiana's chances of winning it all.", " - Much like Indiana, the Chicago Bulls have had to play 30 games so far without their star. ", " is sidelined until after the All-Star break, and the Bulls almost completely replaced the entire \"Bench Mob\", so while I still see the Bulls making the Eastern Conference finals, but I don't see them contending for a ring. Sorry #", ".", " - Simply put, they're the Milwaukee Bucks. It's been a long time since the Bucks were a serious contender, and it's going to be a long time before they are again. The Bucks always seem to have a great big man with average guards, or great guards with no strength in the post.", " - Atlanta has bolted out of the gates this year and many of the NBA's best minds are struggling to understand why. While the Hawks have been a great story so far, that's all going to end come playoff time. We all know that Josh Smith will pull his usual disappearing act, which leaves the Hawks minus a superstar at the most important time of the year.", "New York Knicks - ", " fans are constantly teased and brought to the edge of excitement, year after year, only to see their hopes dashed due to something at the last minute. This year will be no different. By the time Amare ", " is ready to return, he'll disrupt the great chemistry that New York has, leaving them no closer to a championship than they were when battling Michael Jordan in the 90's.", " - While Miami sits atop the East standings right now, they'd better not be organizing their parade through South Beach just yet. The Heat have remained the team to beat in the East, however, losing to teams like ", " and Milwaukee in the same week makes me doubt their focus and killer instinct.", " ", "So with the East behind us, let's break down the Western Conference and why I believe the 2012-13 NBA Champion will come from this side of the country.", " ", " - The ", " finally have playoff team that is almost as strong as the \"KG\" and \"Starbury\" years. The Wolves starting five, once fully healthy, is a fairly imposing lineup. However, once you go to the bench, it's all over. I'm happy to see Minnesota with a good chance to get back into the playoffs, however, I expect them to exit in the first round.", " - Denver got the best of the ", " trade, and having time to gel together this season while adding some key pieces has been the reason for their great play. ", " ", " has been a beast this year, and while I expect the Nuggets to make some noise and cause an upset in the playoffs, I don't see them going all the way just yet.", " - Houston made a great trade in sending ageing star Kevin Martin to Oklahoma City in return for Rockets' main man James Harden. With Harden and Jeremy Lin, the Rockets have a guard combo as good as any in the NBA, however, that's where the star talent ends in Houston. I'd expect to see Houston out in the first round in six games.", " - Golden State finally has a team to be excited about. Not since the days of Run ", " have the Warriors had a team this exciting, young and talented. The main reason I don't see the Warriors making it to the finals this year is because of their lack of quality depth.", " - In my opinion, the Grizzlies have the best defense in the West. While I don't have them making it to the big show this year, I do see them making one or two small moves to get a deeper bench in the offseason, which is their current weakness.", " - Old man Tim Duncan seems to have found new life this year and is consistently playing at a high level again. However, he's not the only old man playing well this year for the Spurs. Tony Parker is in the conversation for MVP this year, and while I see the Spurs taking someone to seven tough games, I don't see them winning that seventh game to get to the Western Conference finals.", " - The Clippers have one of the deepest teams in the NBA, and considering how young they are, it's a little scary thinking about what their future holds. Clippers fans haven't had anything to be this excited about since they had Danny Manning. I see the Clippers meeting the ", " in the Western Conference Finals, in a matchup as exciting as the ", " vs. the ", " from a few years ago.", "Oklahoma City Thunder - With Kevin Durant playing at a career best level and Russell Westbrook finally becoming a team first point guard, the Thunder are the team to beat in the West, in my opinion. They have the kind of team that most organizations would dream of. I believe that the Thunder are not only the best team in the West, but they will ultimately be the best team in the NBA this season. Durant will get his first ring and his team will be a force in the tough Western Conference for the next five years. As a dedicated Bulls fan, I would liken this Thunder team to the Bulls teams of the early 90's—and we all know what they achieved.", " ", "Let me know your thoughts by commenting below or by tweeting me @", ". Remember to share this article with your friends. Let's get a real discussion going here. Thanks for reading.", "Do you want to share your Bleacher Report activity on Facebook?", "\n\t\t", "\n  ", "We'd like to send you the most entertaining ", " articles, videos, and podcasts from around the web.", "\n\t\t\t\t\t\t", "\n\t\t\t\t\t\t", "\n\t\t\t\t\t", "Real-time news for your favorite teams, right on your mobile device.", "B/R's ", " and ", " can give you the edge you need to get ahead.", "\n\t\t\t\tCopyright © 2014 Bleacher Report, Inc. Turner Broadcasting System, Inc. All Rights Reserved.\n\t\t\t\tBleacherReport.com is part of Bleacher Report - Turner Sports Network, part of the Turner Sports and Entertainment Network.\n\t\t\t\tCertain photos copyright © 2014 by Getty Images.\n\t\t\t\tAny commercial use or distribution without the express written consent of Getty Images is strictly prohibited.\n\t\t\t"], "title": ["2012-13 NBA Champion Prediction: Why the Champion Won't Be from the East | Bleacher Report"]},
{"content": ["Welcome back to ", ", our ongoing interview series with influential members of the Twitter measurement universe. This week, we’re happy to highlight ", ", New Media Specialist for the NBA Champion ", " basketball team. Coming off a terrific championship season and an Olympic gold medal for Team USA player and Miami HEAT forward ", ", we thought it would be a great time to get Jim’s views on Twitter measurement. ", " Welcome Jim! Can you describe your role in the HEAT organization? How have you used social media, specifically Twitter, as a part of your social media strategy for the team?", " Our New Media team is the eyes and ears of HEAT fans around the globe. Our job is to connect with as many HEAT fans as we can. We create relationships with our younger fans that will evolve into a strong brand loyalty. We view Twitter as the first true means of establishing two-way communication with our fans. ", "Our franchise is just entering our 25th season, so we are a relatively young franchise. We are just starting to see our first generation of life-long HEAT fans reach fiscal maturity. It is our goal to take advantage of the amazing team we have to build our fan base and social media, and Twitter specifically, allows us to reach out and communicate with fans. ", "We use Twitter to provide real-time coverage of all HEAT related news and events. Our New Media team covers all HEAT practices, games and provides behind-the-scenes coverage of HEAT related events. ", " How important is measurement of engagement on Twitter to your strategy? Do you have specific goals and campaign metrics that you use to measure performance and success?", " Measurement of social media engagement is key for us. While we may not have specific goals for each initiative we undertake, engagement metrics play a key role in our future initiatives. We like to look at the performance of our tweets and use that data to tailor our coverage to the areas we get the most engagement. We always want to deliver the content our fans want the most. ", "We also like to use this data to determine time of posting. We want our posts to generate a lot of replies and we try to provide as many answers as time and scheduling allow. Conversely, pictures and posts that will generate a lot of re-tweets are often made during our “off  hours” since less attention is required. ", " Has your social media measurement strategy changed as you’ve gone from the regular season, to the playoffs, to the champion series, to the off-season? ", " During the season, we utilize a lot of the measurements to build our strategy. Each regular season, we find a different tweeting “sweet spot.”  Some years we see more interactions of pictures, some years it may be statistical information that gets the best response. Our job during the regular season is to perfect our strategy. Socially, we do not want to be become a nuisance.", "I come from an email marketing background. Email marketing has always been referred to as “permission-based marketing.” Moving over to social media, I always treat it as “privilege-based marketing.” We have been lucky to earn a spot in our fans’ timelines and newsfeeds. We treat this as a privilege. We try to avoid straight sales pitches, instead offering exclusive first looks or first opportunities to buy. This gives our sales pitches a more exclusive, offer-based characteristic. ", "Once we hit the post-season, we intensify our social media efforts. We know that our fans’ appetite for information increases and we begin traveling to away games to help provide coverage to which they may not otherwise have access. This coverage increases each round, as fans want more and more information. During the 2012 NBA Finals, we sent two staff members to Oklahoma City to cover everything, and we were rewarded with a really comprehensive behind the scenes look at the team during our title run. ", "Our off-season strategy is to provide relevant content when it occurs, but more so to focus on increasing our interactions with fans. We try to reply to as many relevant mentions as we can, while also increasing the amount of interactive tweets we send out. ", " What’s your opinion on the “second-screen experience” during televised games? Have you seen more consumers actively engaging via Twitter during games and how do you make the most of that for the team?", " During the regular season, we work very closely with our broadcast partner, Sun Sports/Fox Sports Florida. Last off-season, we had a series of social-broadcast meetings and were able to develop a very interactive broadcast. We developed a Facebook Friday component to help draw viewers to our broadcasts, especially when our local broadcast is up against a national broadcast of the game. ", "We also got our broadcasters Eric Reid and Tony Fiorentino on Twitter and they were able to interact with fans and answer some questions live during all broadcasts. Additionally, we created a dedicated hashtag to track all comments.", "Fans were also actively engaged in twitter polls for the pregame spotlights as well as the poll question for games. We wanted to create a very social feel for our broadcasts and are very happy where they stand after our first season. ", " Can you describe one of your more successful social media efforts? Were there specific measurement goals you wanted to achieve and how did the campaign perform? Any lessons learned you can share with our audience?", " I think one of our most successful efforts this year was the unveiling of our new ", ". We knew this would generate buzz, but the scope of the appeal was amazing. We were able to reach over 4.5 million unique accounts and generate almost 17 million impressions. ", "We also made a big social media push for the release of our Miami Floridians throwback jersey. This effort reached over 5.8 million unique people and total impressions reached 13 million. ", "I think the most important thing we took from these campaigns was that we needed to be ready and able to take advantage of these situations the moment they arise. Once we noticed the feedback, the posts, and tweets we were receiving, we really ramped up our efforts. We learned that by monitoring early reaction to a post you can really ride the positive public sentiment and stay ahead of the curve. ", " Thanks, Jim!", "Track and report on your Twitter efforts with TweetReach.", "\r\nSimple, beautiful Twitter analytics for PR and marketing pros.", "Written by Dean Cruse ", "August 23rd, 2012 at 7:24 am", "Posted in ", "Tagged with ", ", ", ", ", ", ", ", ", "\n", "\n", "\n", "\n", "\n", "TweetReach is brought to you by Union Metrics. We focus on delivering simple social metrics that enable marketers and agencies to measure and improve their social media campaigns.", "Here on our TweetReach blog, we share our favorite Twitter tactics and strategies, as well as bigger company announcements and events!", "We make TweetReach, Union Metrics for Tumblr and Union Metrics for Instagram. Learn more at ", ".", "The Journalist template by ", " — Built for "], "title": ["   TakeFive with TweetReach – Jim Kneer at TweetReach Blog"]},
{"content": ["The Dream Shake, a Houston Rockets community", "\n    By ", "\n\n      ", "\n\n    on May 2 2009, 10:19a\n\n    ", "\n\n    \n    \n  ", "Yes, I'm going there.  I have no problems stating it.  Whomever is fortunate to survive the war of attrition that will be the Rockets/Lakers 2nd round series... that's going to be the team that collects this from Mr. Stern in June.", "The Lakers are the obvious favorite to win the series, and the homecourt advantage only helps the cause.  Kobe is ", " of types to win his fourth ring this year.  Let's face it, the Lakers are damned good. ", "Meanwhile, the Rockets just got a massive monkey off their back by winning a first round series.  Which means -- no pressure.  None at all.  While Artest stated to the fans Thursday night that they are not done with their goals, a simple series victory is now going to allow the Rockets to play free and loose.  Don't expect a lot of mental mistakes due to pressure or playing \"tight\".  Yao is no longer an annual playoff flameout.  Hell, you might even see Coach Sleepy call a play or two now.  Anything is possible.  As Simmons likes to state, the proverbial ceiling has been removed.", "The Rockets will be motivated by T-Mac's tears, too (", ".  More reasons for his ", " teammates to stick it to him.)", "And yet... the Lakes are 4-0 against the Rockets so far this year.  Further, the Lakers won an astounding ", "this year.  And somehow did ", " have the best overall record.  The Rockets weren't too shabby at 53 wins, but the Lakers regular season was on a whole different level.", "I can already hear the peanut gallery: ", "\"What about Cleveland?\"  ", "\"Aren't you ignoring the Mavericks and Nuggets?\"  ", "\"The Rockets won't win this series with the referees no longer on their side!!\" ", "(", ")", "Here's why none of that matters -- The only team that is true a matchup nightmare for the Rockets is already eliminated.  (Haha, you suck Utah!)  Denver does not scare me.  Nor does Dallas.  And the Rockets will want revenge for the last game of the regular season if it comes to that.  Over in the East, does Boston scare anyone?  The Rockets own Orlando (", ").  The Rockets have also shown the supposed best team in the NBA ", ".  The last team LeBron wants to see in the NBA Finals would be the Houston Rockets.  (And it's not like the Lakers don't completely own the LeBrons this year either.)", "Remember?  ", "?  Yeah, that was Houston's fault.", "Meanwhile, the Lakers are not exactly a ", " matchup for the Rockets, and all of us here were hoping to avoid Kobe until the Western Conference Finals.  Actually we were hoping that the Rockets could play Dallas... then Denver... and hope that someone eliminated Kobe before the Rockets had to.  But that's no longer an option.  The good news is that the Rockets have a healthy White Pills to throw at Kobe this time around.", " ", "Last four games against the Kobes:", ".  This was the game where fans reached the breaking point in watching Artest dribble around and not pass.  He's been much better since.  This is also the only game where the Lakers faced the current version of the Rockets roster (save for Carl Landry, who will make a huge impact this series).", ".  Also known as the \"don't trash talk Kobe!  Noooo!\" game.  Kobe was quiet, and then Crazy Pills had to go and say something to him about being the ", ".  Whoops.", ".  Also known as the game featured in Michael Lewis' ", ".  Alternatively known as the \"f--k you, Rafer!\" game where he shanked two free throws at the end.  Again.  Fortunately, Rafer is banished from our fair city and won't play a role in this series.  Yeah, I was at this game.  20 feet away from Kobe when he drained that long 3 at the end.  Ugh.  But there was no Artest in this game.  And no Bynum.  Landry had a MONSTER game of his own.", "First game:  ", ".  Tracy McGrady played in this game.  Or, rather, he kinda showed up and took a lot of shots.  He only made one.  Enough said.  I'm going to ignore this game for analysis purposes.  The Rockets from this game are nothing like the current version. ", "In reality, the Rockets have only played the Lakers once this year.  The other three games featured players that won't be anywhere the Staples Center or the Toyota Center over the next two weeks.  (Though T-Mac might be in the trainer's room catching up on the ", ".)", "What should be the goal for Houston?  Steal one of the first two games in L.A.  That's it.  Steal a game, and hold serve at home in Game 3... that's when we'll see whether the Rockets have what it takes to be a champion.  If the good guys can get past Kobe, there isn't a single team in the league that can stop the Rockets.  This is not going to be easy.  But it can be done.", "We'll email you a reset link.", "If you signed up using a 3rd party account like Facebook or Twitter, please ", " with it instead.", "You must be a member of The Dream Shake to participate.", "\n          We have our own ", "\n          at The Dream Shake. You should read them.\n        ", "You must be a member of The Dream Shake to participate.", "\n          We have our own ", "\n          at The Dream Shake. You should read them.\n        ", "Choose an available username to complete sign up.", "In order to provide our users with a better overall experience, we ask for more information from Facebook when using it to login so that we can learn more about our audience and provide you with the best possible experience. We do not store specific user data and the sharing of it is not required to login with Facebook."], "title": ["The winner of the Rockets/Lakers series will be the 2009 NBA Champion - The Dream Shake"]},
{"content": ["Send me ", "*Text messaging rates may apply.", "Please enter a valid phone number.", "Please enter your Phone Number.", " A link has been sent.", "View gallery", " and Dwyane Wade are a defeat away from losing the Finals to the Spurs. (AP) ", "MIAMI – LeBron James and the ", " have worked a miracle in the NBA Finals before. The Heat, however, will need to accomplish something even more miraculous to win a title again by way of the grandest comeback in the Finals, a history dating back to 1950.", "The Heat fell one loss shy of elimination in the Finals to the ", " after a ", ".", "\"We put ourselves in position where it is about making history,\" James said after the defeat, the Heat's second straight blowout to the Spurs.", "Miami needs three straight victories to earn a three-peat championship. Two of those games would be in San Antonio, beginning with Game 5 on Sunday. The Spurs are 10-2 in San Antonio this postseason with the last loss coming against the Heat in Game 2.  ", "View gallery", "Kawhi Leonard defends a LeBron James drive. (AP) ", "No NBA Finals team has come back from a 3-1 deficit since the championship series began 64 years ago. Ever. Only eight teams have come back to win a playoff series after falling behind 3-1. The last to accomplish the feat was the ", " against the ", " in 2006 during Round 1 of the Western Conference playoffs.", "\"I do know the numbers,\" James said. \"It's never been done before. But we're still a confident bunch.\"", "With Michael Jordan in mind, Hall of Famer Charles Barkley is familiar with the unconquered challenge the Heat are facing.", "Back in 1993, Barkley and the Phoenix Suns were down 3-1 to Jordan and the ", ". The Suns won Game 5 in Chicago 108-98 to keep the series alive. But the Bulls won the championship the following game in Phoenix.", "\"Daunting? They have to win two games in San Antonio,\" Barkley said. \"That's over daunting. Daunting is not the right word. The right word is impossible. I don't see them coming back. The reason I don't think they have a chance is because these games haven't been close.", "\"It ain't like there have been one or two plays where you say the Heat can make an adjustment here or there. They have been beaten at home soundly.\"", "The Heat's three losses have come by an average of 18.3 points, although Game 1 James suffered leg cramps before the Spurs went on a massive run. Nobody other than James is playing better than average for the Heat.", "While the spotlight will be on James to put on a Superman cape to save his Heat, the four-time NBA Most Valuable Player knows he needs help.", "Heat coach Erik Spoelstra replaced forward Rashard Lewis with guard Ray Allen at the start of the second half with the Spurs up 55-36. Allen responded with two points. Struggling point guard Mario Chalmers has scored 13 total points in the Finals. Barkley noted the Spurs' size has taken its toll on the Heat as well. With the Heat struggling with scoring, should they activate offensive-minded forward Michael Beasley, too?", "Desperate times often lead to desperate new lineups. Spoelstra might be one of those desperate coaches after he takes a deep breath.", "\"We'll look at everything right now,\" Spoelstra said. \"But I'm going to take a step back, exhale. I've got to find a way to do a better job for my group.\"", "Don't expect the Spurs to relax for a second considering how the championship trophy slipped out of their hands last year. While it won't be easy to end it, the Spurs are using the Game 6 collapse from a year ago – surrendering a 94-89 lead with 28 seconds left – as motivation and a reminder not to allow another Ray Allen miracle to happen again.", "\"We have a lot of respect for Miami,\" Spurs guard ", " said. \"They're the two-time [defending] champs. They're a great team and there is still one more game. We have to win one more game.", "\"So we just have to stay focused and we'll be ready. We just have to think about last year. We don't need more motivation than that.\"", "Yes, more than a daunting task for the Heat."], "title": ["Mission impossible: Heat's task of stealing another title from Spurs looks more than 'daunting' - Yahoo Sports"]},
{"content": ["The Larry O’ Brien Trophy is the sacred object hoisted up by best team at the end of the NBA season. Larry O’Brien was once the Post Master General for the United States of America and later became the commissioner of the NBA from 1975 to 1983.", "The trophy that was renamed the Larry O’Brien Trophy  and was originally called the Walter A. Brown Trophy.  They renamed it in honor of Larry O’Brien and the work he did as commissioner of the NBA.", "Before 1983 when a team won the NBA Championship they were given two Walter A. Brown trophies, one to keep in the teams facilities and also the original trophy that would be held on to until a new champion was crowned, then it would be passed on to them (much like the Stanley Cup).", " ", "After 1983 when the Larry O’Brien Trophy was adopted teams were given a single new trophy each year, there was no longer an original to be passed on.  Players will sometimes pay to have copies made for their personal collection.", "Since the league started awarding the Larry O’Brien trophy there have only been seven winners, they are as follows:", "Heat-2", "Rockets-2", "Pistons-3", "Spurs-4", "Celtics-4", "Bulls-6", "Lakers-8", " ", " ", "\r\n\t\t", "\r\n\t\t", "\r\n\t\t", "\r\n\t\t", "\r\n\t\t", "\r\n\t\t", "\n\t\t\t\t\t\t\t", "\n\t\t\t\t\t\t\t", "\n", "\n\t\t\t\t\t\t"], "title": ["The Forest Lab   » The Larry O’Brien Trophy"]},
{"content": [" ", "\n                ", "\n17 NBA Championships...A record 8 in a row from 1959-1966...Three separate Championship eras...When it comes to hanging \nChampionship Banners, the Celtics are the cream of the crop. No organization has won more titles than the 17-time World \nChampion Boston Celtics. Whether it's the Green's ", ", \ntheir ", " or the \n", ", the \nCeltics tradition of winning championships has stood the test of time. \n", "\n  Copyright © 2014 NBA Media Ventures, LLC. All rights reserved.\n  No portion of NBA.com may be duplicated, redistributed or manipulated in any form.\n  By accessing any information beyond this page, you agree to abide by the\n  ", "  /\n  ", "  and\n  ", "  |\n  ", "\n        This site uses cookies and similar technologies to customize and enhance your online experience.  By using this site, you accept our use of these technologies.  To learn more, please read our ", ".\n        "], "title": ["Championship Wins | Boston Celtics"]},
{"content": ["The ", " would have been an exciting playoff series regardless of which teams made the championship round, but the fact that the San Antonio Spurs will square off against the Miami Heat makes it even more interesting.", "San Antonio and Miami met in 2013 for the NBA championship, and a rematch this year is what many predicted leading into this season. ESPN’s Drew ", " was not surprised by the meeting:", "Wait a minute. It's Spurs-Heat for the NBA title??? I can't believe it! Its like the title game we all predicted in November.", "Take a look at the entire 2014 finals schedule and series predictions for the Heat vs. Spurs: ", "Source: NBA.com *If necessary.", "Now that you've seen the schedule and game-by-game predictions, here are the championship odds:", "Source: OddsShark.com", " ", "There are few ", " in the NBA that can polarize the sport the way the San Antonio Spurs vs. Miami Heat tilts have in the past, and for the second year in a row, the two teams will square off with the NBA championship on the line.", "San Antonio is the quintessential team. There are no overpowering egos in the locker room, and every member of the roster is fighting for the players around him. Traditionalist basketball fans will side with the Spurs in the finals.", "As for Miami, the franchise built its winning roster through free agency, and the team was constructed around stars. With LeBron James, ", " and ", " joining forces on the Heat, many fans have grown to dislike the defending champions.", "Fans are genuinely excited for this series, but they’re not alone. ESPN is also anticipating the marquee matchup, and ", "'s", "official Twitter account and the company’s stat department shared some interesting notes:", "Round 2! The Spurs and Heat will face off again in the NBA Finals, after a 7-game thriller last season. ", "Spurs + Heat to meet in NBA Finals for 2nd straight season, 1st NBA Finals rematch since Bulls vs Jazz in 1997 and 1998", "After beating the Oklahoma City Thunder in the Western Conference Finals, San Antonio's Tim Duncan told ", " about his excitement surrounding the matchup with Miami:", "It's unbelievable to regain that focus after that devastating loss that we had last year, but we're back here. We're excited about it. We've got four more to win. We'll do it this time. We're happy it's the Heat again. We've got that bad taste in our mouths still.", "Both of these franchises know how to win and know how to be victorious in the NBA Finals. With the right mixture of defensive pressure and offensive ability, there is no doubt that this series will be an intense battle that should go the distance.", "John ", " of NBA.com took to Twitter to talk about the dominance of each team in its home building:", "Heat (8-0) & Spurs (9-1) are a combined 17-1 at home in the playoffs, both scoring over 116 pp100p: ", "While there is no discounting the offensive pressure that James, Wade and Bosh can put on a defense, San Antonio has one of the best defensive game plans in the league. With plenty of bench depth as well, the Spurs will not be afraid to get physical.", "San Antonio has a smart core of players led by Duncan, Manu Ginobili and Tony Parker—as long as the point guard's ", " ", "’t a long-term issue—and that should be enough to hold off the pressure from the Heat.", "Regardless of which team is victorious, the big winners will be the fans.", " San Antonio, 4-3", " ", "Do you want to share your Bleacher Report activity on Facebook?", "\n\t\t", "\n  ", "We'd like to send you the most entertaining ", " articles, videos, and podcasts from around the web.", "\n\t\t\t\t\t\t", "\n\t\t\t\t\t\t", "\n\t\t\t\t\t", "Real-time news for your favorite teams, right on your mobile device.", "B/R's ", " and ", " can give you the edge you need to get ahead.", "\n\t\t\t\tCopyright © 2014 Bleacher Report, Inc. Turner Broadcasting System, Inc. All Rights Reserved.\n\t\t\t\tBleacherReport.com is part of Bleacher Report - Turner Sports Network, part of the Turner Sports and Entertainment Network.\n\t\t\t\tCertain photos copyright © 2014 by Getty Images.\n\t\t\t\tAny commercial use or distribution without the express written consent of Getty Images is strictly prohibited.\n\t\t\t"], "title": ["NBA Finals Predictions 2014: Heat vs. Spurs Schedule, Odds and Series Forecast  | Bleacher Report"]},
{"content": ["Sign in to comment!", "The Spurs are old.", "Tim Duncan is 38, Manu Ginobili is 36, Tony Parker is the youngster in San Antonio's star trio at 32.", "ADVERTISEMENT", "ADVERTISEMENT", "Though it's still their team, soon it will belong to Kawhi Leonard, who was 6 when Duncan played his first game with San Antonio and won't turn 23 until later this month.", "Leonard already has the quintessential San Antonio qualities down pat: Show up, work hard, play hard, win often, don't say much, call it a day.", "His star shone brightest in Game 3 of the finals against the Miami Heat on Tuesday with a 29-point breakout. And after that win, the Spurs will try to take a 3-1 series lead when the matchup resumes Thursday in Miami.", "\"I don't think you're ever going to get him to sit down and expound on a whole lot of things,\" Spurs coach Gregg Popovich said. \"He just wants to do his job. He wants to be a great player and go home. That's basically who he is.\"", "It's still hard to believe Leonard wasn't exactly burdened by huge expectations when joining the Spurs.", "\"I just knew I wasn't going to get the ball right away or just be a focal point with these great players on the team,\" Leonard said. \"But now I just try to play my game and go out there and be aggressive.\"", "He'll be a focal point of the Miami defensive plan on Thursday. And here's five other things to know going into Game 4 of the NBA Finals:", "___", "MUST WIN FOR MIAMI: Miami's season cannot end Thursday. But if the Heat lose Game 4, the Spurs can safely go ahead and order that fifth championship banner. Only eight teams in NBA history have successfully rallied from 3-1 deficits, and none of those eight did it during the finals.", "IMPROVING SPURS? Not many teams could open a game 19 for 21 from the field, beat a two-time defending NBA champion by 19 points on the road in a finals matchup, then say they have to do better —  and mean it. Such is life with the Spurs. Manu Ginobili said the Spurs saw \"many mistakes\" on the tape of Game 3. \"The thing is that we masked it with making so many shots. ... So the mistakes you made kind of faded away,\" Ginobili said.", "THE HEAT STREAK: For whatever reason, losses bring out the best in the Heat at playoff time. Miami has won its last 13 games immediately following a defeat in the postseason, the most recent of those victories coming in Game 2 of this series. Those 13 wins have come by an average of 14.4 points, and six of them have been absolute blowouts of 18 points or more.", "SCORING SPURS: When San Antonio won its first NBA title, the Spurs had exactly two games of 100 points or more in that postseason run. They have 14 already in these playoffs, going 12-2 in those games. When not scoring at least 100 so far in this postseason, the Spurs are a mere 2-5.", "HOT HEAT: Miami is shooting 49.8 percent so far in these playoffs, putting the Heat on pace for the best postseason field-goal percentage since Orlando shot 49.9 percent in 1996. Among teams that won at least one series, the last to shoot better than 50 percent in a postseason was the 1991 Chicago Bulls, who connected on 51.4 percent of their shots on the way to Michael Jordan's first championship.", "Advertisement", "Advertisement", "This material may not be published, broadcast, rewritten, or redistributed. ©2014 FOX News Network, LLC. All rights reserved. All market data delayed 20 minutes. ", " - ", " - "], "title": ["5 things to watch in Game 4 of the NBA Finals matchup between San Antonio and Miami | Fox News"]},
{"content": ["\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n \n", "\n \n", "Have more to add? News tip? ", "By Dwain Price", "\n\n\n\n     Because of their superior depth, attention to detail, exceptional basketball IQ, battle-tested head coach and home-court advantage, the San Antonio Spurs will win this year’s NBA title. ", "Dwain Price, 817-390-7760 ", "AP", "Eric Gay", "Tim Duncan, left, and Tony Parker led the Spurs to the 2007 NBA title, and it looks like they’ll do so again this season.\n\n", "We welcome your comments on this story, but please be civil. Do not use profanity, hate speech, threats, personal abuse, images, internet links or any device to draw undue attention. Our policy requires those wishing to post here to use their real identity.\n", " | ", " | ", "\n\n"], "title": ["Make no mistake about it, Spurs will win NBA championship | Dallas-Fort Worth Sports News - S..."]},
{"content": ["Game says he and Kevin Durant have spoken and agreed that there was a miscommunication between \"the middle party, which was 'TMZ.'\"", " // ", " // ", "\n\t\t\t", " > ", " > Lil Wayne Predicts 2013-2014 NBA Champion", " Victoria Hernandez", "posted ", " | ", "Lil Wayne joins ESPN's \"First Take\" to talk Miami Heat versus San Antonio Spurs with Steven A. Smith and Skip Bayless. ", "A day after ", ", frequent collaborator ", " appeared on the program today (June 11) to give his opinion regarding the championship series.", "The Young Money rapper says the Miami Heat will win the NBA Championship in seven games, despite losing 111-92 to the San Antonio Spurs in Game 3 at home yesterday (June 10). Lil Wayne says that unlike the", " hosts Steven A. Smith and Skip Bayless and DJ Khaled, who all picked the Heat to win Game 3, he knew the Spurs would take the victory.", "“It’s the influence Pop have on the team,” he says, referencing Spurs head coach Gregg Popovich. “They have like one of the rarest teams in the league that actually still listen to the coach.”", "For the Heat, LeBron James and Dwyane Wade both scored 22 points. Mario Chalmers has started at the point guard for all three games and has scored three, five and two points in each matchup.", "“If (Chalmers) ain’t showing up that he’s not ready to play like he’s been showing, he has to sit down,” says Lil Wayne.", "James has had an inconsistent series. He left Game 1 in the fourth quarter with cramps. He scored 35 points in a Game 2 victory, but had a quieter Game 3 going 9-of-14. Lil Wayne says that the Heat will be able to overcome this stumble.", "“Last night was obviously...it was something I probably woulda never see again,” the rapper says. “LeBron has a killer instinct, but it’s off and on.”", "Weezy calls Heat fans beautiful and denies that they are fair-weathered.", "“If the team’s winning, you’re supposed to root for them,” he says. “They need motivation.”", "During the ", "segment, co-hosts Steven A. Smith and Skip Bayless get in a heated argument over comparisons of LeBron James to Michael Jordan. Lil Wayne sits back and smiles through most of it, but does offer his own opinion at the end. “Nobody’s Michael Jordan,” he says.", "Lil Wayne is expected to release ", "later this year. ", " ", "This is a test of the error system", "Add New Comment", "Got an account with one of these? Log in here, or just enter your info and leave a comment below.", "Now that you're logged in, you don't have to fill out a captcha.", "This is a test of the error system", "Got an account with one of these? Log in here, or just enter your info and leave a comment below.", "Now that you're logged in, you don't have to fill out a captcha.", "Enter for a chance to attend A3C's \"The Circuit U.S. Tour\".", "Enter for a chance to win a White Gold Finish Simulated Diamond G Shock watch!", "© 2014 Cheri Media Group", "\n\t\t\t\tAll Rights Reserved", " | ", " | ", " | ", " | ", " | ", " ", " | ", " | ", " | ", " | ", " | ", " | ", " | ", " | ", " | ", " | ", " | "], "title": ["Lil Wayne Predicts 2013-2014 NBA Champion | Get The Latest Hip Hop News, Rap News & Hip Hop Album Sales | HipHop DX"]},
{"content": ["Getty Images", "NEW YORK, NY - MAY 10:  LeBron James #6 of the Miami Heat reacts after Game Three of the Eastern Conference Semifinals during the 2014 NBA Playoffs at the Barclays Center on May 10, 2014 in the Brooklyn borough of New York City. The Brooklyn Nets defeated the Miami Heat 104-90. (Photo by Elsa/Getty Images)", "The Miami Heat joined very elite company Friday night when the team won a fourth straight Eastern Conference championship title by beating the Indiana Pacers.", "The Heat became just the third franchise in NBA history to ever make it to four straight NBA Finals joining the Boston Celtics (1957-1966; 1984-1987) and the Los Angeles Lakers (1982-1985). But Miami is far from done and is poised to join an even more elite group by winning three straight championships.", "The last two teams to make it to four straight NBA Finals, the Lakers and Celtics in the 1980’s, won two championships during their four year runs. Miami already has two championships in the can and could three-peat with a victory in the 2014 NBA Finals.", "The teams that have won three-straight championships included some of the greatest players in the history of the game, names like: Michael Jordan, Scottie Pippen, Bill Russell, Wilt Chamberlain, Shaquille O’Neal, and Kobe Bryant.", "The Heat is now on the cusp of joining that elite group if the team can knock off the eventual Western Conference champion, either the San Antonio Spurs or the Oklahoma City Thunder. Coincidentally, the Spurs and Thunder are the two teams Miami has beaten the last two seasons to win its two straight championships.", "The Spurs and Heat have played each other seven times dating back to 2011 and Miami has won five of the seven games, including four last year in the NBA Finals. The Heat and Thunder have played eight times dating back to 2011 and Miami has a 5-3 record against Oklahoma City, including four wins in the 2012 NBA Finals.", "Whoever wins in the Western Conference will be facing a Miami Heat juggernaut that is peaking as the team hits the NBA Finals.", "How good was the Heat in the Game 6 victory over the Pacers? With eight minutes to go in the game, LeBron James, Chris Bosh, and Dwyane Wade had a combined 63 points. The entire Pacers team had 67 points.", "Miami will get the next five days to rest before the NBA Finals get started next week with Game 1 either in Oklahoma City or San Antonio."], "title": ["Heat Head To 4th Straight NBA Finals  | NBC 6 South Florida"]},
{"content": ["Cancel", "Set"], "title": ["Sports News & Articles – Scores, Pictures, Videos - ABC News"]},
{"content": ["All Events", "Big Events", "Today's Racing", "Ante-Post Racing", "This Week", "Long Term", "More", "This Week", "Grand Slams", "Other Events", "Tennis Specials", "All Events", "Big Events", "All Events", "Big Events", "All Events", "Big Events", "All Events", "Current Events", "Domestic Events", "Specials", "Future Events", "All Events", "All Events", "All Events", "All Events", "Big Events", "All Events", "Big Events", "All Events", "All Events", "All Events", "Big Events", " OF FREE BETS!", "CLAIM NOW ", "All Events", "Big Events", "Open a new account with ", " and they'll give you a 100% deposit bonus of up to ", ".\n                                                                     You'll get another 100% bonus up to £50 when you place your 1st bet via mobile or tablet.", "\n                                                                  ", "Open an account with Sky Bet, place your 1st bet & get a free matched bet up to £30. ", "\n                                                                  ", "Register an account, place a bet on any event of your choice at Evs or above & Totesport will match your stake with a\n                                                                     free bet up to ", " ", "\n                                                                  ", "Register a Boylesports account, place your first bet of £5 or more and if it loses they will ", " Then place a further five bets and get another ", "\n                                                                     ", "\n                                                                  ", "Register with Betfred, place your first bet from £1-£25 at odds of evens or more, & ", ".\n                                                                     ", "\n                                                                  ", "Open an account with Sportingbet, deposit and place a bet at odds of 1.5 or greater and get a free bet up to £50 if it loses.", "Register an account with Bet Victor & they’ll ", " ", "\n                                                                  ", "Open a new account, place £10 in bets and ", " will give you a free £20 bet. ", "\n                                                                  ", "Open a new account with StanJames.com through Oddschecker & claim a £10 free bet! ", "\n                                                                  ", "Join 888sport, place your first bet of £10 at odds of evens or greater & they will match it with a ", ". Then place further bets to earn up to ", ". ", "\n                                                                  ", "Open an account at ", " using promo code F100, place a single bet of £5 or more at odds of at least\n                                                                     1/2 and get a free matched bet of up to £100.", "\n                                                                  ", "Open a new ", " account through Oddschecker, bet £5+ and receive a free £20 bet! Plus, place a World Cup winner bet\n                                                                     & get money back as a free bet up to £25 if Brazil or Argentina win! ", "\n                                                                  ", "Sign up to WilliamHill using promo code WC20, place your first bet of £10 and get 2 x £10 free bets! ", "\n                                                                  ", "Open an account with Winner Sports and when you deposit and bet £10 or more at odds greater than Evens, they will give you\n                                                                     a 200% deposit match up to £50.", "\n                                                                  ", "Open an account with Spreadex and receive a ", " fixed odds bet up to the value of ", ".\n                                                                     E.g. if you placed a bet at 11/4 you would get odds of 11/2 for this bet. You must place 5 fixed odds sports bets to qualify\n                                                                     for the double-the-odds bet. ", "\n                                                                  ", "Open an account with Betfair, bet at least £10 on the Sportsbook, and get a matched free bet up to £50! See site for full\n                                                                     details.\n                                                                  ", "Open a new account with ", " and they will match your opening deposit with a ", "\n                                                                     up to ", "! ", "\n                                                                  ", "Wager your deposit three times at odds of 1.7 or more and bwin will credit you with up to ", "!", "Open a new ", " account and receive a £20 risk free bet, after your 1st deposit of £10 or more. If your\n                                                                     1st bet loses, Unibet will refund you up to £20. ", "\n                                                                  ", "Register a new account with Youwin, place your first bet of £20, and they will match your stake with a £20 free bet! ", "Open a new account with ", ", stake at least £20 on your first Exchange bet, if it loses, get a £20 refund.\n                                                                     Plus, get £50 cashback for every £100 you pay in commission, up to £1000.", "\n                                                                  ", "Open a BETDAQ account today & place a bet up to £25 and if it loses, Betdaq will refund your bet.", "\n                                                                  ", "Open an account with ", " and you will receive a ", " no lose first bet. Matchbook betting\n                                                                     exchange offer the best prices and biggest limits available online.", "\n                                                                  ", "Place a 4-fold (or more) on the NBA and if just one of your selections is a loser, Sportingbet will refund your stake. ", "\n                                                                  ", "Odds shown come direct from online bookmakers. Please ", "check all aspects of your bets before placement. ", "The Best Odds Are ", "Featured Events", "Latest Big Events", "Recently Viewed", "No pages viewed yet", "Select Country", "Oddschecker", "An error occured"], "title": ["NBA Championship Betting Odds | NBA Finals Odds | Oddschecker"]},
{"content": ["Saturday, June 14, 2014 As of 10:31 PM EDT", "U.S. Edition", "The Miami Heat are just one victory away from reaching their fourth consecutive NBA Finals. Not only does the team have the best betting odds to win the title, but they are the odds-on favorite to take home the Larry O’Brien Trophy.", " puts Miami’s championship odds at -110. The Heat have a 3-1 series lead over the Indiana Pacers in the Eastern Conference Finals.", "Indiana finished the regular season with the best record in the East, but that hasn’t done them much good in the playoffs. They’re considered to have virtually no chance of winning their first ever NBA title. The Pacers' odds sit at -5000.", "The NBA doesn’t have many examples of teams coming back from 3-1 series deficits. Only eight teams in the league’s history have ever done it. Most recently, the Phoenix Suns beat the Los Angeles Lakers in seven games in their 2006 first-round series.", "LeBron James and Co. won’t be easy to beat for either one of the Western Conference teams. The four-time MVP is averaging 28.8 points per game in the postseason, shooting below 50 percent from the field in just one playoff game. Dwyane Wade has proven to be healthy, scoring 22 points a game against Indiana.", "Miami has faced both the San Antonio Spurs and Oklahoma City Thunder in the last two NBA Finals. San Antonio was much tougher to eliminate, losing to Miami in a deciding seventh game last year. In 2012, the Heat defeated the Thunder in five games, including four straight victories to end the series.", "The oddsmakers agree that the Spurs would give the Heat a bigger challenge in 2014, as well. Even though San Antonio and Oklahoma City are tied at 2-2 in their series, the Spurs’ title odds are set at +180, compared to the Thunder’s +400 odds.", "San Antonio is still a slight favorite to reach the NBA Finals, because they have home-court advantage. However, the Thunder have been dominant in the last two games, winning by 22 total points. Two years ago, Oklahoma City beat San Antonio in the conference finals, after losing the first two games of the series. Both teams would have home-court advantage in the NBA Finals.", "The odds of a Miami-San Antonio rematch have been set at -200. A Miami-Oklahoma City Finals matchup has been given +175 odds. An Indiana-Oklahoma City Finals is considered the biggest longshot at +4000. ", "© Copyright 2014 ", " All Rights Reserved.", "More ", " ", "More ", " ", "More ", " ", "More ", " ", "More ", " ", "More ", " ", "More ", " ", "More ", " "], "title": ["NBA Playoffs Betting Odds 2014: Chances The Heat, Spurs, Thunder And Pacers Win The NBA Championship"]},
{"content": ["\n            ", ": 11: 2001-2012", ": 2008 (Celtics)", ": 3.1 PPG 0.8 APG 2.0 RPG", "While fans of the teams for which he played usually praise the White Mamba, there's probably a good reason he didn't play a single playoff game the year he became an NBA champion. Does that matter to Scalabrine? Apparently not. When asked about his lack of playing time at the post-series press conference, he responded, \"", "\" Brian Scalabrine: 2008 Finals MVP. ", "Most Popular: ", " ", "\n\t\t", "Links We Like\n\t", "Most Popular:  ", " "], "title": ["11. Brian Scalabrine — The Worst Players to Win an NBA Championship | Complex"]},
{"content": ["The revelers who had lingered along Biscayne Boulevard hours after Game 3 of the NBA Finals were gone after another game and another defeat two days later, vanishing just like their beloved team.", "The party may be over in South Beach, and not just because the Miami Heat probably isn't going to win a third consecutive title.", "This could be it for the Big Three, rumored to be on the verge of becoming a Big Four when actually it may have been reduced to a Big One in its final incarnation.", "LeBron James was like a king trying to rule without any knights or squires during the Heat's 21-point loss to the San Antonio Spurs in Game 4 on Thursday night at AmericanAirlines Arena.", "Miami trails, three games to one, and could be done for the season, if not forever in its present form, as soon as Game 5 on Sunday in San Antonio. None of the previous 31 teams facing as similar series deficit in the Finals has come back to win.", "Something is horribly amiss when James finishes with 28 points and his four fellow starters combine to only match that total. Wait, it gets worse: James scored 19 of the Heat's 21 points in the third quarter, a Mario Chalmers layup accounting for the balance.", "Why would James possibly want to go through another season with a starting point guard (Chalmers) who might be fourth string on the Spurs; a shooting guard (Dwyane Wade) who may have finally fossilized before our eyes in Game 4; a power forward (Chris Bosh) who is oddly underutilized; and a bench that deserves a demotion?", "You want to anoint proposed newcomer Carmelo Anthony as the savior? Surely that would help a defense that looked as if it were playing checkers to the Spurs' chess in back-to-back home defeats by an average of 20 points.", "Miami's weaknesses were masked for months by the Febreze of the Eastern Conference, the stench of so many shortcomings covered by scads of games against the Philadelphia 76ers, Orlando Magic and Boston Celtics. Even so, it was telling that the Heat lost 12 more games than it did last year, when it won a second consecutive championship.", "The inescapable reality is that while the East festers like a Donald Sterling lawsuit, the Western Conference continues to strengthen. Even if next season is the end of the Tim Duncan-Tony Parker-Manu Ginobili Spurs as we know them, Oklahoma City, the Clippers, Golden State, Portland and Houston are all on the verge of becoming championship-level teams.", "Even more troubling than the Heat's recent dysfunction on the court is its apparent disconnect off it.", "Said Bosh after Game 4: \"Right now I think we just need to go home and do some soul-searching or do whatever it is that guys need to do and get it together.\"", "Said James, a few minutes later: \"Soul-searching, there won't be much of that. There won't be much of that at all for me.\"", "James also seems to be reading from a different script than his coach, Erik Spoelstra.", "Said Spoelstra: \"We'll lay everything out, look under the hood and see what we need to do.\"", "Said James, when apprised of Spoelstra's quote: \"That shouldn't happen in the Finals. That should happen from day one.\"", "Sounds like a group hug is in order.", "If \"The Heatles,\" as they have come to be known, want to become a Fab Four with the addition of Anthony this summer, they'll all have to opt out of their contracts and take massive pay cuts.", "A smarter option might be to opt out and come back at reduced rates so that the Heat can add two or three mid-level players and avoid the top-heavy approach that threatens to topple their championship run. The list of available unrestricted free agents will include Kyle Lowry (who made $6.2 million in 2013-14), Spencer Hawes ($6.5 million) and Rodney Stuckey ($8.5 million), each of whom would provide the kind of quality depth Miami sorely lacks.", "For all its been-there, won-that posturing amid back-to-back blowouts, the Heat is on the verge of going somewhere it never envisioned as recently as two days ago: back to South Beach empty-handed.", "It figures to be a lonely stroll.", "Kawhi Leonard sprinted unchecked into the paint late in the first half as teammate Patty Mills' shot arced toward the basket. Leonard leaped into the air and snagged the ball as it bounced off the rim, throwing down a vicious two-handed dunk to put the San Antonio Spurs ahead by 22 points.", "Clippers owner Donald Sterling has hired four firms to dig up embarrassing information about NBA executives and fellow team owners, according to a person familiar with the latest escalation in Sterling's seven-week battle to maintain control of his team.", "That was some star-laden cast in \"The Longest Day,\" the 1962 film about D-Day with John Wayne, Henry Fonda, Richard Burton and Robert Mitchum.", "The U.S. soccer team gathered in a meeting room at the team hotel here Thursday afternoon to watch the opening game of a World Cup it won't officially become part of until Monday, when it meets Ghana in the northeastern coastal city of Natal.", "What a blessing that the Spanish comfort food paella is commonly served on extra-large platters. Spain's haughty soccer interests might feel an urge to pig out in search of comfort after watching the harshest defeat ever for a World Cup defending champion.", "As the day inched forward at this U.S. Open golf tournament Friday, the tension became unbearable. Drama dripped. Who would be best positioned to get second place?", "Arms folded, Mike Gillespie slowly circles the dirt-meets-grass perimeter of the infield at UC Irvine's baseball stadium, pausing every few feet to monitor an intrasquad scrimmage from a different angle, with a different gaze, in a different glint of sunlight.", "Texas' drought is finally over — at least in baseball."], "title": ["NBA Finals' fade is no fluke: Miami Heat needs a mirror - Los Angeles Times"]}]